{
    "principles": [
        {
            "paraText": "Information and user interface components must be presentable to users in ways they\n            can perceive.\n         ",
            "guidelines": [
                {
                    "paraText": "Provide text alternatives for any non-text content so that it can be changed into\n               other forms people need, such as large print, braille, speech, symbols or simpler\n               language.\n            ",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/non-text-content.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=111#non-text-content",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/non-text-content.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>All non-text content that is presented to the user has a text alternative that serves the equivalent purpose, except for the situations listed below.\n   </p>\n   \n   <dl>\n      \n      <dt>Controls, Input</dt>\n      \n      <dd>\n         \n         <p>If non-text content is a control or accepts user input, then it has a name that describes its purpose. (Refer to Success Criterion 4.1.2 for additional requirements for controls and content that accepts user input.)\n         </p>\n         \n      </dd>\n      \n      <dt>Time-Based Media</dt>\n      \n      <dd>\n         \n         <p>If non-text content is time-based media, then text alternatives at least provide descriptive\n            identification of the non-text content. (Refer to Guideline 1.2 for additional requirements for media.)\n         </p>\n         \n      </dd>\n      \n      <dt>Test</dt>\n      \n      <dd>\n         \n         <p>If non-text content is a test or exercise that would be invalid if presented in text, then text alternatives at least provide descriptive identification of the non-text\n            content.\n         </p>\n         \n      </dd>\n      \n      <dt>Sensory</dt>\n      \n      <dd>\n         \n         <p>If non-text content is primarily intended to create a specific sensory experience, then text alternatives at least provide descriptive identification of the non-text\n            content.\n         </p>\n         \n      </dd>\n      \n      <dt>CAPTCHA</dt>\n      \n      <dd>\n         \n         <p>If the purpose of non-text content is to confirm that content is being accessed by\n            a person rather than a computer, then text alternatives that identify and describe\n            the purpose of the non-text content are provided, and alternative forms of CAPTCHA\n            using output modes for different types of sensory perception are provided to accommodate\n            different disabilities.\n         </p>\n         \n      </dd>\n      \n      <dt>Decoration, Formatting, Invisible</dt>\n      \n      <dd>\n         \n         <p>If non-text content is pure decoration, is used only for visual formatting, or is not presented to users, then it is implemented\n            in a way that it can be ignored by assistive technology.\n         </p>\n         \n      </dd>\n      \n   </dl>\n   \n",
                            "id": "1.1.1",
                            "name": "Non-text Content",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A bar chart compares how many widgets were sold in June, July, and August. The short\n               label says, &quot;Figure one - Sales in June, July and August.&quot; The longer description\n               identifies the type of chart, provides a high-level summary of the data, trends and\n               implications comparable to those available from the chart. Where possible and practical,\n               the actual data is provided in a table."
                                },
                                {
                                    "content": "The link to an audio clip says, &quot;Chairman&apos;s speech to the assembly.&quot; A link to a text\n               transcript is provided immediately after the link to the audio clip."
                                },
                                {
                                    "content": "An animation shows how a car engine works. There is no audio and the animation is\n               part of a tutorial that describes how an engine works. Since the text of the tutorial\n               already provides a full explanation, the image is an alternative for text and the\n               text alternative includes only a brief description of the animation and refers to\n               the tutorial text for more information."
                                },
                                {
                                    "content": "A Web site allows users to select from a variety of Web cameras positioned throughout\n               a major city. After a camera is selected, the image updates every two minutes. A short\n               text alternative identifies the Web camera as &quot;traffic Web camera.&quot; The site also\n               provides a table of travel times for each of the routes covered by the Web cameras.\n               The table is also updated every two minutes."
                                },
                                {
                                    "content": "A photograph of two world leaders shaking hands accompanies a news story about an\n               international summit meeting. The text alternative says, &quot;President X of Country X\n               shakes hands with Prime Minister Y of country Y.&quot;"
                                },
                                {
                                    "content": "The same image is used in a different context intended to explain nuances in diplomatic\n               encounters. The image of the president shaking hands with the prime minister appears\n               on a Web site discussing intricate diplomatic relationships. The first text alternative\n               reads, &quot;President X of country X shakes hands with Prime Minister Y of country Y on\n               January 2, 2009.&quot; An additional text alternative describes the room where the leaders\n               are standing as well as the expressions on the leaders&apos; faces, and identifies the\n               other people in the room. The additional description might be included on the same\n               page as the photograph or in a separate file associated with the image through a link\n               or other standard programmatic mechanism."
                                },
                                {
                                    "content": "A Web page includes a link to an audio recording of a press conference. The link text\n               identifies the audio recording. The page also links to a text transcript of the press\n               conference. The transcript includes a verbatim record of everything the speakers say.\n               It identifies who is speaking as well as noting other significant sounds that are\n               part of the recording, such as applause, laughter, questions from the audience, and\n               so on."
                                },
                                {
                                    "content": "An e-learning application uses sound effects to indicate whether or not the answers\n               are correct. The chime sound indicates that the answer is correct and the beep sound\n               indicates that the answer is incorrect. A text description is also included so that\n               people who can&apos;t hear or understand the sound understand whether the answer is correct\n               or incorrect."
                                },
                                {
                                    "content": "A thumbnail image of the front page of a newspaper links to the home page of the &quot;Smallville\n               Times&quot;. The text alternative says &quot;Smallville Times&quot;."
                                },
                                {
                                    "content": "Different alternatives for an image of the world: An image of the world that is used\n               on a travel site as a link to the International Travel section has the text alternative\n               &quot;International Travel&quot;. The same image is used as a link on a university Web site\n               with the text alternative &quot;International Campuses&quot;."
                                },
                                {
                                    "content": "An image of a building floor plan is interactive, allowing the user to select a\n               particular room and navigate to a page containing information about that room.\n               The short text alternative describes the image and its interactive purpose:\n               &quot;Building floor plan. Select a room for more information.&quot;"
                                }
                            ]
                        }
                    ],
                    "id": "1.1",
                    "name": "Text Alternatives"
                },
                {
                    "paraText": "Provide alternatives for time-based media.",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/audio-only-and-video-only-prerecorded.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=121#audio-only-and-video-only-prerecorded",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/audio-only-and-video-only-prerecorded.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>For prerecorded\n      audio-only and prerecorded video-only media, the following are true, except when the audio or video is a media alternative for text and is clearly labeled as such:\n   </p>\n   \n   <dl>\n      \n      <dt>Prerecorded Audio-only</dt>\n      \n      <dd>\n         \n         <p>An alternative for time-based media is provided that presents equivalent information for prerecorded audio-only content.\n         </p>\n         \n      </dd>\n      \n      <dt>Prerecorded Video-only</dt>\n      \n      <dd>\n         \n         <p>Either an alternative for time-based media or an audio track is provided that presents\n            equivalent information for prerecorded video-only content.\n         </p>\n         \n      </dd>\n      \n   </dl>\n   \n",
                            "id": "1.2.1",
                            "name": "Audio-only and Video-only (Prerecorded)",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "The link to an audio clip says, &quot;Chairman&apos;s speech to the assembly.&quot; A link to a text\n               transcript is provided immediately after the link to the audio clip."
                                },
                                {
                                    "content": "A Web page includes a link to an audio recording of a press conference that identifies\n               the audio recording. The page also links to a text transcript of the press conference.\n               The transcript includes a verbatim record of everything the speakers say. It identifies\n               who is speaking as well as noting other significant sounds that are part of the recording,\n               such as applause, laughter, questions from the audience, and so on."
                                },
                                {
                                    "content": "An animation shows how a car engine works. There is no audio and the animation is\n               part of a tutorial that describes how an engine works. Since the text of the tutorial\n               already provides a full explanation, the media is an alternative for text and the\n               text alternative includes only a brief description of the animation and refers to\n               the tutorial text for more information."
                                },
                                {
                                    "content": "A silent movie includes an audio track which includes a description of the action in the video."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/captions-prerecorded.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=122#captions-prerecorded",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/captions-prerecorded.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Captions are provided for all prerecorded\n      audio content in synchronized media, except when the media is a media alternative for text and is clearly labeled as such.\n   </p>\n   \n",
                            "id": "1.2.2",
                            "name": "Captions (Prerecorded)",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "\n            <p><strong>A captioned tutorial</strong></p>\n            <p>A video clip shows how to tie a knot. The captions read, </p>\n            <p>&quot;(music) </p>\n            <p>Using rope to tie knots was an important skill</p>\n            <p>for the likes of sailors, soldiers and woodsmen..&quot; </p>\n            <p>From Sample Transcript Formatting by Whit Anderson.</p>\n         "
                                },
                                {
                                    "content": "\n            <p>An orchestra provides captions for videos of performances. In addition to capturing\n               dialog and lyrics verbatim, captions identify non-vocal music by title, movement,\n               composer, and any information that will help the user comprehend the nature of the\n               audio. For instance captions read,</p>\n            <p>&quot;[Orchestral Suite No. 3.2 in D major, BWV 1068, Air]</p>\n            <p>[Johann Sebastian Bach, Composer] </p>\n            <p>&#x266A; Calm melody with a slow tempo &#x266A;&quot;</p>\n            \n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/audio-description-or-media-alternative-prerecorded.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=123#audio-description-or-media-alternative-prerecorded",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/audio-description-or-media-alternative-prerecorded.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>An alternative for time-based media or audio description of the prerecorded\n      video content is provided for synchronized media, except when the media is a media alternative for text and is clearly labeled as such.\n   </p>\n   \n",
                            "id": "1.2.3",
                            "name": "Audio Description or Media Alternative (Prerecorded)",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "\n            <p>\n               <strong>Describer: </strong>A title, &quot;Teaching Evolution Case Studies. Bonnie Chen.&quot; A teacher shows photographs\n               of birds with long, thin beaks.\n            </p>\n            \n            <p> \n               <strong>Bonnie Chen: </strong>&quot;These photos were all taken at the Everglades.&quot;\n            </p>\n            \n            <p> \n               <strong>Describer: </strong>The teacher hands each student two flat, thin wooden sticks.\n            </p>\n            \n            <p> \n               <strong>Bonnie Chen: </strong>&quot;Today you will pretend to be a species of wading bird that has a beak like this.&quot;\n            </p>\n            \n            <p> \n               <strong>Describer: </strong>The teacher holds two of the sticks to her mouth making the shape of a beak.\n            </p>\n            \n            <p>Transcript of audio based on the first few minutes of &quot;<a href=\"https://www.pbs.org/wgbh/evolution/educators/teachstuds/tvideos.html\">Teaching Evolution Case Studies, Bonnie Chen</a>&quot; (copyright WGBH and Clear Blue Sky Productions, Inc.)</p>\n            "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/captions-live.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=124#captions-live",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/captions-live.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Captions are provided for all live\n      audio content in synchronized media.\n   </p>\n   \n",
                            "id": "1.2.4",
                            "name": "Captions (Live)",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "A news organization provides a live, captioned Web cast. "
                                },
                                {
                                    "content": "An orchestra provides Communication Access Realtime Translation (CART) captioning\n               of each real-time Web performance. The CART service captures lyrics and dialog as\n               well as identifies non-vocal music by title, movement, composer, and any information\n               that will help the user comprehend the nature of the audio."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/audio-description-prerecorded.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=125#audio-description-prerecorded",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/audio-description-prerecorded.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Audio description is provided for all prerecorded\n      video content in synchronized media.\n   </p>\n   \n",
                            "id": "1.2.5",
                            "name": "Audio Description (Prerecorded)",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": " \n            <p>\n               <strong>Describer: </strong>A title, &quot;Teaching Evolution Case Studies. Bonnie Chen.&quot; A teacher shows photographs\n               of birds with long, thin beaks.\n            </p>\n            \n            <p> \n               \n               <strong>Bonnie Chen: </strong>&quot;These photos were all taken at the Everglades.&quot;\n            </p>\n            \n            <p> \n               \n               <strong>Describer: </strong>The teacher hands each student two flat, thin wooden sticks.\n            </p>\n            \n            <p> \n               \n               <strong>Bonnie Chen: </strong>&quot;Today you will pretend to be a species of wading bird that has a beak like this.&quot;\n            </p>\n            \n            <p> \n               \n               <strong>Describer: </strong>The teacher holds two of the sticks to her mouth making the shape of a beak.\n            </p>\n            \n            <p>Transcript of audio based on the first few minutes of &quot;<a href=\"http://www.pbs.org/wgbh/evolution/educators/teachstuds/tvideos.html\">Teaching Evolution Case Studies, Bonnie Chen</a>&quot; (copyright WGBH and Clear Blue Sky Productions, Inc.)</p>\n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/sign-language-prerecorded.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=126#sign-language-prerecorded",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/sign-language-prerecorded.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Sign language interpretation is provided for all prerecorded\n      audio content in synchronized media.\n   </p>\n   \n",
                            "id": "1.2.6",
                            "name": "Sign Language (Prerecorded)",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": " \n            \n            <strong> Example 1.</strong> A corporation is making an important announcement to all of its employees. The announcement\n            will be held in the main headquarters and later streamed to the Web. A sign language interpreter\n            is provided at the announcement location for the employees that are present in the meeting room. For the Web version of\n            the announcement, the sign language interpreter is shown/superimposed in the corner of the display.\n         "
                                },
                                {
                                    "content": " \n            \n            <strong> Example 2.</strong> A university is providing an online version of a particular lecture by creating\n            a synchronized media presentation of the professor delivering the lecture. The presentation\n            includes video of the professor speaking and demonstrating a science experiment. A\n            sign language interpretation of the lecture is created after the lecture and presented on the Web with\n            the synchronized media version.\n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/extended-audio-description-prerecorded.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=127#extended-audio-description-prerecorded",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/extended-audio-description-prerecorded.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Where pauses in foreground audio are insufficient to allow audio descriptions to convey the sense of the video, extended audio description is provided for all prerecorded\n      video content in synchronized media.\n   </p>\n   \n",
                            "id": "1.2.7",
                            "name": "Extended Audio Description (Prerecorded)",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "\n            <em>Example 1. Video of a lecture.</em> A physics professor is giving a lecture. The professor makes freehand sketches on the whiteboard,\n            speaking rapidly while drawing. As soon as discussion on one problem is finished, the professor\n            erases the drawing and makes another sketch while continuing to speak and gesture.\n             The video is paused between problems, and extended audio description\n            of the professor&apos;s drawings and gestures is provided; the video is then resumed.\n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/media-alternative-prerecorded.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=128#media-alternative-prerecorded",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/media-alternative-prerecorded.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>An alternative for time-based media is provided for all prerecorded\n      synchronized media and for all prerecorded video-only media.\n   </p>\n   \n",
                            "id": "1.2.8",
                            "name": "Media Alternative (Prerecorded)",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "A community center purchases a Training video for use by its clients and puts it on\n               the center&apos;s intranet. The video involves explaining use of a new technology and has\n               a person talking and showing things at the same time. The community center provides\n               an alternative for time-based media that all clients, including those who can neither\n               see the demonstrations nor hear the explanations in the synchronized media, can use\n               to better understand what is being presented."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/audio-only-live.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=129#audio-only-live",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/audio-only-live.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>An alternative for time-based media that presents equivalent information for live\n      audio-only content is provided.\n   </p>\n   \n",
                            "id": "1.2.9",
                            "name": "Audio-only (Live)",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "A public relations firm uses Web based caption services to cover live events; the\n            output from the service is incorporated in a sub frame of the Web page which includes\n            the streaming audio control.\n         "
                                },
                                {
                                    "content": "A live radio play of a fringe theatre group is being broadcast to the Web. As the\n            actors stick largely to a set script, and the budget for the program is small, the\n            producers provide a link (with the playwright&apos;s permission) to the script of the play.\n         "
                                },
                                {
                                    "content": "A streaming audio server uses a technology which can also accommodate text and graphics,\n            such as HTML. A stenographer is used to create live captions at an\n            event, and these are mixed on the fly to produce live captions in the media stream\n            which can be viewed by the media player. \n         "
                                },
                                {
                                    "content": "A CEO is to give a press release by telephone to the media in response to a breaking\n            news story, the audio is being recorded and streamed over the internet, but due to\n            time constraints a Web captioning service cannot be set up in time. As the press release\n            is a set statement which the CEO will be reading out, the company simultaneously provides\n            the transcript of the release.\n         "
                                }
                            ]
                        }
                    ],
                    "id": "1.2",
                    "name": "Time-based Media"
                },
                {
                    "paraText": "Create content that can be presented in different ways (for example simpler layout)\n               without losing information or structure.\n            ",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/info-and-relationships.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=131#info-and-relationships",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/info-and-relationships.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Information, structure, and relationships conveyed through presentation can be programmatically determined or are available in text.\n   </p>\n   \n",
                            "id": "1.3.1",
                            "name": "Info and Relationships",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A form contains several required fields. The labels for the required fields are displayed\n               in red. In addition, at the end of each label is an asterisk character, *. The instructions\n               for completing the form indicate that &quot;all required fields are displayed in red and\n               marked with an asterisk *&quot;, followed by an example."
                                },
                                {
                                    "content": "A form contains both required and optional fields. Instructions at the top of the\n               form explain that required fields are labeled with red text and also with an icon\n               whose text alternative says, &quot;Required.&quot; Both the red text and the icon are programmatically\n               associated with the appropriate form fields so that assistive technology users can\n               determine the required fields."
                                },
                                {
                                    "content": "A bus schedule consists of a table with the bus stops listed vertically in the first\n               column and the different buses listed horizontally across the first row. Each cell\n               contains the time when the bus will be at that bus stop. The bus stop and bus cells\n               are identified as headers for their corresponding row or column so that assistive\n               technology can programmatically determine which bus and which bus stop are associated\n               with the time in each cell."
                                },
                                {
                                    "content": "In a form, the labels for each checkbox can be programmatically determined by assistive\n               technology."
                                },
                                {
                                    "content": "A simple text document is formatted with double blank lines before titles, asterisks\n               to indicate list items and other standard formatting conventions so that its structure\n               can be programmatically determined."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/meaningful-sequence.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=132#meaningful-sequence",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/meaningful-sequence.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>When the sequence in which content is presented affects its meaning, a correct reading sequence can be programmatically determined.\n   </p>\n   \n",
                            "id": "1.3.2",
                            "name": "Meaningful Sequence",
                            "level": "A",
                            "examples": [
                                {
                                    "content": " \n            \n            <strong>Example 1:</strong> In a multi-column document, the linear presentation of the content flows from the\n            top of a column to the bottom of the column, then to the top of the next column.\n         "
                                },
                                {
                                    "content": " \n            \n            <strong>Example 2:</strong> CSS is used to position a navigation bar, the main story on a page, and a side story.\n            The visual presentation of the sections does not match the programmatically determined\n            order, but the meaning of the page does not depend on the order of the sections.\n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/sensory-characteristics.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=133#sensory-characteristics",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/sensory-characteristics.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Instructions provided for understanding and operating content do not rely solely on\n      sensory characteristics of components such as shape, color, size, visual location, orientation,\n      or sound.\n   </p>\n  \n  \n   \n",
                            "id": "1.3.3",
                            "name": "Sensory Characteristics",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A table presents a list of times across the top row and a list of events in the first\n               vertical column and instructions are provided under the table: &quot;Events marked with a\n               blue diamond are played on field A and events marked with a green circle are played\n               on field B.&quot; The instructions rely on color and shape only and result in a failure of\n               this criterion."
                                },
                                {
                                    "content": "An online multi-page survey uses a link implemented as a green arrow icon placed\n               in the lower right hand corner of the content to move from one survey page to the\n               next. The arrow is clearly labeled with &quot;Next&quot; and the instructions state, &quot;To move\n               to the next section of the survey, select the green arrow icon labeled &apos;Next&apos; in the\n               lower right corner below the last survey question.&quot; \n               The instruction uses positioning and color to help identify the icon; \n               the instruction does not rely on these sensory characteristics since it also refers to\n               the label, so it passes this criterion."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/orientation.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=134#orientation",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/orientation.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n  <p>Content does not restrict its view and operation to a single display orientation, such as portrait or landscape, unless a specific display orientation is essential.</p>\n   \t\t\t\t\n   \n   \t\t\t\t\t\n",
                            "id": "1.3.4",
                            "name": "Orientation",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "<strong>Example 1: Online video site</strong><br>\n\t\t\t\tA video is shown in either portrait or in landscape based on the user&apos;s chosen orientation."
                                },
                                {
                                    "content": "<strong>Example 2: Messaging website</strong><br>\n\t\t\t\tA messaging website can display messages in both portrait and landscape orientations. "
                                },
                                {
                                    "content": "<strong>Example 3: eReader web app</strong><br>\n\t\t\t\tAn eReader web app can display the contents of a book in both portrait and landscape orientation."
                                },
                                {
                                    "content": "<strong>Example 4: Check deposit in banking app</strong><br>\n\t\t\t\tAn example where orientation is essential could be a banking app that requires the device be in landscape mode to easily and accurately capture an image of a check for deposit. These paper forms are typically about twice as wide as they are high."
                                },
                                {
                                    "content": "<strong>Example 5: Piano app</strong><br>\n\t\t\t\tAn example where orientation is essential could be a piano app that requires the device to be in landscape mode to allow room for enough of the piano keys to be functionally usable. Since a piano app is emulating a physical piano keyboard that needs to retain relative physical characteristics between keys, either too few keys would be available, or the keys would be much too narrow."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/identify-input-purpose.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=135#identify-input-purpose",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/identify-input-purpose.html#examples"
                            },
                            "contentMarkup": "\n\t\n\t\n\t\n\t\n\t\n\t<p>The purpose of each input field collecting information about the user can be programmatically determined when:</p>\n  \n  <ul>\n    <li>The input field serves a purpose identified in the Input Purposes for user interface components section; and</li>\n    <li>The content is implemented using technologies with support for identifying the expected meaning for form input data.</li>\n  </ul>\n  \n",
                            "id": "1.3.5",
                            "name": "Identify Input Purpose",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "A contact form auto-fills in the fields for name, street, post code, city, telephone number and email address from autofill values stored in the user&apos;s browser. Assistive technology can offer a customized way of identifying particular input fields, for example drawing on a set of symbols / icons that is familiar to the user, to communicate the purpose of the fields visually."
                                },
                                {
                                    "content": "A product order form fills in the address fields for billing address and a separate set of address fields for the shipping address, using the autofill detail tokens &apos;billing&apos; and &apos;shipping&apos;"
                                },
                                {
                                    "content": "A browser plugin to add icons inserts icons representing the person&apos;s name, home address, telephone number and email address to  identify the input purpose visually."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/identify-purpose.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=136#identify-purpose",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/identify-purpose.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n  <p>In content implemented using markup languages, the purpose of user interface components, icons, and regions can be programmatically determined.</p>\n",
                            "id": "1.3.6",
                            "name": "Identify Purpose",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "A website uses <a href=\"https://www.w3.org/WAI/ARIA/apg/practices/landmark-regions/\">ARIA landmarks</a> to identify the regions of the page, and users can hide areas that do not have a role of <code>main</code>."
                                },
                                {
                                    "content": "The links in the navigation of a website are marked up so that users can add their own icons."
                                },
                                {
                                    "content": "Icons on a website are marked up so that users can substitute their own icon sets into the page."
                                }
                            ]
                        }
                    ],
                    "id": "1.3",
                    "name": "Adaptable"
                },
                {
                    "paraText": "Make it easier for users to see and hear content including separating foreground from\n               background.\n            ",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/use-of-color.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=141#use-of-color",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/use-of-color.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Color is not used as the only visual means of conveying information, indicating an\n      action, prompting a response, or distinguishing a visual element.\n   </p>\n   \n   \n  \n",
                            "id": "1.4.1",
                            "name": "Use of Color",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A form contains both required and optional fields. Instructions at the top of the\n               form explain that required fields are labeled with red text and also with an icon.\n               Users who cannot perceive the difference between the optional field labels and the\n               red labels for the required fields will still be able to see the icon next to the\n               red labels."
                                },
                                {
                                    "content": "Students view an SVG image of a chemical compound and identify the chemical elements\n               present based <strong>both</strong> on the colors used, as well as numbers next to each\n               element. A legend shows the color and number for each type of element. Sighted users who\n               cannot perceive all the color differences can still understand the image by relying on\n               the numbers."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/audio-control.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=142#audio-control",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/audio-control.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>If any audio on a Web page plays automatically for more than 3 seconds, either a mechanism is available to pause or stop the audio, or a mechanism is available to control audio\n      volume independently from the overall system volume level.\n   </p>\n   \n   \n   \n",
                            "id": "1.4.2",
                            "name": "Audio Control",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "An audio file begins playing automatically when a page is opened. However, the audio\n            can be stopped by the user by selecting a &quot;silent&quot; link at the top of the page.\n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/contrast-minimum.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=143#contrast-minimum",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/contrast-minimum.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>The visual presentation of text and images of text has a contrast ratio of at least 4.5:1, except for the following:\n   </p>\n   \n   <dl>\n      \n      <dt>Large Text</dt>\n      \n      <dd>\n         \n         <p>Large-scale text and images of large-scale text have a contrast ratio of at least 3:1;\n         </p>\n         \n      </dd>\n      \n      <dt>Incidental</dt>\n      \n      <dd>\n         \n         <p>Text or images of text that are part of an inactive user interface component, that are pure decoration, that are not visible to anyone, or that are part of a picture that contains significant\n            other visual content, have no contrast requirement.\n         </p>\n         \n      </dd>\n      \n      <dt>Logotypes</dt>\n      \n      <dd>\n         \n         <p>Text that is part of a logo or brand name has no contrast requirement.</p>\n         \n      </dd>\n      \n   </dl>\n   \n",
                            "id": "1.4.3",
                            "name": "Contrast (Minimum)",
                            "level": "AA",
                            "examples": []
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/resize-text.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=144#resize-text",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/resize-text.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Except for captions and images of text, text can be resized without assistive technology up to 200 percent without loss of content or functionality.\n   </p>\n   \n",
                            "id": "1.4.4",
                            "name": "Resize Text",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "\n            A user with vision impairments increases the text size on a Web page in a browser\n            from 1 em to 1.2 ems. While the user could not read the text at the smaller size,\n            they can read the larger text. All the information on the page is still displayed when\n            the larger font is used for the text.\n            \n         "
                                },
                                {
                                    "content": "\n            A Web page contains a control for changing the scale of the page. Selecting different\n            settings changes the layout of the page to use the best design for that scale.\n            \n         "
                                },
                                {
                                    "content": "\n            Users with a zoom function in their user agent change the scale of the content.\n            All the content scales uniformly, and the user agent provides scroll bars, if necessary.\n            \n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/images-of-text.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=145#images-of-text",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/images-of-text.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>If the technologies being used can achieve the visual presentation, text is used to convey information rather than images of text except for the following:\n   </p>\n   \n   <dl>\n      \n      <dt>Customizable</dt>\n      \n      <dd>\n         \n         <p>The image of text can be visually customized to the user&apos;s requirements;\n         </p>\n         \n      </dd>\n      \n      <dt>Essential</dt>\n      \n      <dd>\n         \n         <p>A particular presentation of text is essential to the information being conveyed.\n         </p>\n         \n      </dd>\n      \n   </dl>\n   \n   \n   \n",
                            "id": "1.4.5",
                            "name": "Images of Text",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "Rather than using bitmap images to present headings in a specific font and size, an\n               author uses CSS to achieve the same result."
                                },
                                {
                                    "content": "A Web page uses server-side scripting to present text as an an image. The page includes\n               controls that allow the user to adjust the font size and foreground and background\n               colors of the generated image."
                                },
                                {
                                    "content": "A Web page contains a quote. The quote itself is presented as italicized text, indented\n               from the left margin. The name of the person to whom the quote is attributed is below\n               the quote with 1.5x the line space and further indented from the left margin. CSS\n               is used to position the text; set the spacing between lines; as well as display the\n               text&apos;s font family, size, color and decoration."
                                },
                                {
                                    "content": "A Web page contains a menu of navigation links that have both an icon and text to\n               describe their target. CSS is used to display the text&apos;s font family, size and foreground\n               and background colors; as well as the spacing between the navigation links."
                                },
                                {
                                    "content": "A Web site contains the organization&apos;s logo in the top left corner of each Web page.\n               The logo contains logotype (text as part, or all, of the logo). The visual presentation\n               of the text is essential to the identity of the logo and is included as a gif image\n               which does not allow the text characteristics to be changed. The image has a text\n               alternative."
                                },
                                {
                                    "content": "A Web page contains information about a particular font family. Substituting the font\n               family with another font would defeat the purpose of the representation. The representation\n               is included as a jpeg image which does not allow the text characteristics to be changed.\n               The image has a text alternative."
                                },
                                {
                                    "content": "A Web page contains a representation of an original letter. The depiction of the letter\n               in its original format is essential to information being conveyed about the time period\n               in which it was written. The letter is included as a gif image which does not allow\n               the text characteristics to be changed. The image has a text alternative."
                                },
                                {
                                    "content": "A form allows users to enter blocks of text. The form provides a number of buttons,\n               including functions to style the text and check spelling. Some of the buttons use\n               text characters that do not form a sequence that expresses something in human language.\n               For example &quot;B&quot; to increase font weight, &quot;I&quot; to italicize the text and &quot;ABC&quot; to check\n               the spelling. The symbolic text characters are included as gif images which do not\n               allow the text characteristics to be changed. The buttons have text alternatives."
                                },
                                {
                                    "content": "A Web site allows users to specify font settings and all images of text on the site\n               are then provided based on those settings."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/contrast-enhanced.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=146#contrast-enhanced",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/contrast-enhanced.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>The visual presentation of text and images of text has a contrast ratio of at least 7:1, except for the following:\n   </p>\n   \n   <dl>\n      \n      <dt>Large Text</dt>\n      \n      <dd>\n         \n         <p>Large-scale text and images of large-scale text have a contrast ratio of at least 4.5:1;\n         </p>\n         \n      </dd>\n      \n      <dt>Incidental</dt>\n      \n      <dd>\n         \n         <p>Text or images of text that are part of an inactive user interface component, that are pure decoration, that are not visible to anyone, or that are part of a picture that contains significant\n            other visual content, have no contrast requirement.\n         </p>\n         \n      </dd>\n      \n      <dt>Logotypes</dt>\n      \n      <dd>\n         \n         <p>Text that is part of a logo or brand name has no contrast requirement.</p>\n         \n      </dd>\n      \n   </dl>\n   \n",
                            "id": "1.4.6",
                            "name": "Contrast (Enhanced)",
                            "level": "AAA",
                            "examples": []
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/low-or-no-background-audio.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=147#low-or-no-background-audio",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/low-or-no-background-audio.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>For prerecorded\n      audio-only content that (1) contains primarily speech in the foreground, (2) is not an audio\n      CAPTCHA or audio logo, and (3) is not vocalization intended to be primarily musical expression\n      such as singing or rapping, at least one of the following is true:\n   </p>\n   \n   <dl>\n      \n      <dt>No Background</dt>\n      \n      <dd>\n         \n         <p>The audio does not contain background sounds.</p>\n         \n      </dd>\n      \n      <dt>Turn Off</dt>\n      \n      <dd>\n         \n         <p>The background sounds can be turned off.</p>\n         \n      </dd>\n      \n      <dt>20 dB</dt>\n      \n      <dd>\n         \n         <p>The background sounds are at least 20 decibels lower than the foreground speech content,\n            with the exception of occasional sounds that last for only one or two seconds.\n         </p>\n         \n         \n         \n      </dd>\n      \n   </dl>\n   \n",
                            "id": "1.4.7",
                            "name": "Low or No Background Audio",
                            "level": "AAA",
                            "examples": []
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/visual-presentation.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=148#visual-presentation",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/visual-presentation.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>For the visual presentation of blocks of text, a mechanism is available to achieve the following:\n   </p>\n   <ul>\n     <li>Foreground and background colors can be selected by the user.</li>   \n     <li>Width is no more than 80 characters or glyphs (40 if CJK).</li>   \n     <li>Text is not justified (aligned to both the left and the right margins).</li>   \n     <li>Line spacing (leading) is at least space-and-a-half within paragraphs, and paragraph spacing is at least 1.5 times larger than the line spacing.</li>   \n     <li>Text can be resized without assistive technology up to 200 percent in a way that does not require the user to scroll horizontally to read a line of text on a full-screen window.</li>   \n  </ul>\n\n\n\n\n  \n",
                            "id": "1.4.8",
                            "name": "Visual Presentation",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "Figure 1<p>The following images show examples of single-spacing, space-and-a-half and double-spaced text in a paragraph.</p>"
                                },
                                {
                                    "content": "\n      <h2>Examples</h2>\n      \n      <figure id=\"figure-text-cut\">\n        \n        <img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/single-space.gif\" alt=\"Example of single-spaced text. (no space between each line of text)\">\n        <img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/space-and-a-half.gif\" alt=\"Example of space-and-a-half text. (a space equal to half the height of a line of text line)\">\n        <img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/double-space.gif\" alt=\"Example of double-spaced text. (a space equal to the height of a line of text between each line)\">\n      </figure>\n\n      <p>Examples of glyphs include  &quot;A&quot;, &quot;&#x2192;&quot; (an arrow symbol), and &quot;&#x3055;&quot; (a Japanese character).</p>\n      \n   "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/images-of-text-no-exception.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=149#images-of-text-no-exception",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/images-of-text-no-exception.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Images of text are only used for pure decoration or where a particular presentation of text is essential to the information being conveyed.\n   </p>\n   \n   \n   \n",
                            "id": "1.4.9",
                            "name": "Images of Text (No Exception)",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "A Web page contains a quote. The quote itself is presented as italicized text, indented\n               from the left margin. The name of the person to whom the quote is attributed is below\n               the quote with 1.5x the line space and further indented from the left margin. CSS\n               is used to position the text; set the spacing between lines; as well as display the\n               text&apos;s font family, size, color and decoration."
                                },
                                {
                                    "content": "A Web page contains a menu of navigation links that have both an icon and text to\n               describe their target. CSS is used to display the text&apos;s font family, size and foreground\n               and background colors; as well as the spacing between the navigation links."
                                },
                                {
                                    "content": "A Web site contains the organization&apos;s logo in the top left corner of each Web page.\n               The logo contains logotype (text as part, or all, of the logo). The visual presentation\n               of the text is essential to the identity of the logo and is included as a gif image\n               which does not allow the text characteristics to be changed. The image has a text\n               alternative."
                                },
                                {
                                    "content": "A Web page contains information about a particular font family. Substituting the font\n               family with another font would defeat the purpose of the representation. The representation\n               is included as a jpeg image which does not allow the text characteristics to be changed.\n               The image has a text alternative."
                                },
                                {
                                    "content": "A Web page contains a representation of an original letter. The depiction of the letter\n               in its original format is essential to information being conveyed about the time period\n               in which it was written. The letter is included as a gif image which does not allow\n               the text characteristics to be changed. The image has a text alternative."
                                },
                                {
                                    "content": "A form allows users to enter blocks of text. The form provides a number of buttons,\n               including functions to style the text and check spelling. Some of the buttons use\n               text characters that do not form a sequence that expresses something in human language.\n               For example &quot;B&quot; to increase font weight, &quot;I&quot; to italicize the text and &quot;ABC&quot; to check\n               the spelling. The symbolic text characters are included as gif images which do not\n               allow the text characteristics to be changed. The buttons have text alternatives."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/reflow.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=1410#reflow",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/reflow.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   <p>Content can be presented without loss of information or functionality, and without requiring scrolling in two dimensions for:</p>\n   <ul>\n       <li>Vertical scrolling content at a width equivalent to 320 CSS pixels;</li>\n       <li>Horizontal scrolling content at a height equivalent to 256 CSS pixels.</li>\n   </ul>\n   <p>Except for parts of the content which require two-dimensional layout for usage or meaning.</p>\n  \n   \n   \n   \n   \t\t\t\t\n",
                            "id": "1.4.10",
                            "name": "Reflow",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "\n              <strong>One column view in responsive design</strong>\n              <p><video controls=\"controls\"><source src=\"https://alastairc.uk/w3c/reflow-example-1-BBC.mp4\" type=\"video/mp4\"><source src=\"https://alastairc.uk/w3c/reflow-example-1-BBC.ogv\" type=\"video/ogg\">Animation of zooming in on a responsive site. The content reflows to fit the screen.</video></p>\n              <p>Note that as the zoom percentage increases, the navigation changes first to hide options behind a &quot;More&quot; dropdown menu. As zooming continues, most navigation options are eventually behind a &quot;hamburger&quot; menu button. All the information and functionality is still available from this web page. There is no horizontal scrolling.</p>\n            "
                                },
                                {
                                    "content": "\n              <strong>PDF offering reflow</strong>\n              <p>In a PDF created to conform to PDF/Universal Accessibility (ISO 14289), the content can be reflowed and zoomed in to make reading possible for someone with low-vision.</p>\n            "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/non-text-contrast.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=1411#non-text-contrast",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/non-text-contrast.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   <p>The visual presentation of the following have a contrast ratio of at least 3:1 against adjacent color(s):</p>\n   \t\t\t\t\t\n   <dl>\n      \t\t\t\t\t\t\n      <dt>User Interface Components</dt>\n      \t\t\t\t\t\t\n     <dd>Visual information required to identify user interface components and states, except for inactive components or where the appearance of the component is determined by the user agent and not modified by the author;</dd>\n      \t\t\t\t\t\t\n      <dt>Graphical Objects</dt>\n      \t\t\t\t\t\t\n      <dd>Parts of graphics required to understand the content, except when a particular presentation of graphics is essential to the information being conveyed.</dd>\n      \t\t\t\t\t\t\n   </dl>\n  \n",
                            "id": "1.4.11",
                            "name": "Non-text Contrast",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "\n\t\t\t\t<h3>Pie Charts</h3>\n\t\t\t\t<p>Pie charts make a good case study for the graphical objects part of this success criterion, the following pie charts are intended to convey the proportion of market share each browser has. Please Note: The actual figures are made up, these are not actual market shares. </p>\n\t\t\t\t<figure id=\"figure-failing-pie-chart\">\n\t\t\t\t\t<img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/graphics-contrast_pie-chart_fail.png\" alt=\"Failing pie chart\">\n\t\t\t\t\t<figcaption>Figure 20\n\t\t\t\t\t\t<p><strong>Fail:</strong> The pie chart has labels for each slice (so passes 1.4.1 Use of Color), but in order to understand the proportions of the slices you must discern the edges of the slices (the graphical objects conveying essential information), and the contrast between the slices is not  3:1 or greater. </p>\n\t\t\t\t\t</figcaption>\n\t\t\t\t</figure>\n\t\t\t\t<figure id=\"figure-not-applicable-pie-chart\">\n\t\t\t\t\t<img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/graphics-contrast_pie-chart_na.png\" alt=\"Not applicable pie chart\">\n\t\t\t\t\t<figcaption>Figure 21\n\t\t\t\t\t\t<p><strong>Not applicable:</strong> The pie chart has visible labels <em>and</em> values that convey equivalent information to the graphical objects (the pie slices). </p>\n\t\t\t\t\t</figcaption>\n\t\t\t\t</figure>\n\t\t\t\t<figure id=\"figure-passing-pie-chart\">\n\t\t\t\t\t<img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/graphics-contrast_pie-chart_pass.png\" alt=\"Passing pie chart\">\n\t\t\t\t\t<figcaption>Figure 22\n\t\t\t\t\t\t<p><strong>Pass:</strong> The pie chart has visible labels, and sufficient contrast around and between the slices of the pie chart (the graphical objects). A darker border has been added around the yellow slice in order to achieve the contrast level.</p>\n\t\t\t\t\t</figcaption>\n\t\t\t\t</figure>\n\t\t\t"
                                },
                                {
                                    "content": "\n\t\t\t\t<h3>Infographics</h3>\n\t\t\t\t<figure id=\"figure-infographic-light-circles\">\n\t\t\t\t\t<img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/infographic-fail.png\" alt=\"An infographic showing lightly colored circles of various sizes to indicate the size of five different social networks\">\n\t\t\t\t\t<figcaption>Figure 23\n\t\t\t\t\t\t<p><strong>Fail:</strong> Discerning the circles is required to understand the size of network and discerning the icons in each circle is required to identify which network it shows.</p>\n\t\t\t\t\t</figcaption>\n\t\t\t\t</figure>\n\t\t\t\t<p>The graphical objects are the circles (measured against the background) and the icons in each circle (measured against the circle&apos;s background).</p>\n\t\t\t\t<figure id=\"figure-infographic-contrasting-text\">\n\t\t\t\t\t<img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/infographic-pass.png\" alt=\"The same infographic with contrasting text, dark borders around the circles, and contrasting icons.\">\n\t\t\t\t\t<figcaption>Figure 24\n\t\t\t\t\t\t<p><strong>Pass:</strong> The circles have contrasting borders and the icons are a contrasting dark color against the light circle backgrounds.</p>\n\t\t\t\t\t</figcaption>\n\t\t\t\t</figure>\n\t\t\t\t<p>There are many possible solutions to ensuring contrast, the example shows the use of borders. Other techniques are to use darker colors for the circle backgrounds, or to add text labels &amp; values for each item.</p>\n\t\t\t"
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/text-spacing.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=1412#text-spacing",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/text-spacing.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   <p>In content implemented using markup languages that support the following text style properties, no loss of content or functionality occurs by setting all of the following and by changing no other style property:</p>\n   \n   <ul>\n     <li>Line height (line spacing) to at least 1.5 times the font size;</li>\n     <li>Spacing following paragraphs to at least 2 times the font size;</li>\n     <li>Letter spacing (tracking) to at least 0.12 times the font size;</li>\n     <li>Word spacing to at least 0.16 times the font size.</li>\n   </ul>\n \n <p>Exception: Human languages and scripts that do not make use of one or more of these text style properties in written text can conform using only the properties that exist for that combination of language and script.</p>\n\n \n\n \n \n",
                            "id": "1.4.12",
                            "name": "Text Spacing",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "\n    <h2>Examples</h2>\n    <p>When spacing is being overridden to the SC&apos;s metrics:</p>\n    <ul>\n      <li>Text fits within the bounds of its containing box without being cut off.</li>\n      <li>Text fits within the bounds of its containing box without overlapping other boxes.</li>\n    </ul>\n  "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/content-on-hover-or-focus.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=1413#content-on-hover-or-focus",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/content-on-hover-or-focus.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n       \n    \t<p>Where receiving and then removing pointer hover or keyboard focus triggers additional content to become visible and then hidden, the following are true:</p>\n\n  <dl>\n\n    <dt>Dismissible</dt>\n    <dd>A mechanism is available to dismiss the additional content without moving pointer hover or keyboard focus, unless the additional content communicates an input error or does not obscure or replace other content;</dd>\n\n    <dt>Hoverable</dt>\n   <dd>If pointer hover can trigger the additional content, then the pointer can be moved  over the additional content without the additional content disappearing;</dd>\n\n    <dt>Persistent</dt>\n    <dd>The additional content remains visible until the hover or focus trigger is removed, the user dismisses it, or its information is no longer valid.</dd>\n\n  </dl>\n    \t\n    \t<p>Exception: The visual presentation of the additional content is controlled by the user agent and is not modified by the author.</p>\n\n    \t\n     \n     \n  ",
                            "id": "1.4.13",
                            "name": "Content on Hover or Focus",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "\n\t\t\t\t<h3>Example 1: Dismissable Tooltip</h3>\n\t\t\t\t<figure id=\"figure-mouse-tooltip-below\">\n\t\t\t\t<img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/button-pointer-tooltip.png\" alt=\"Screenshot of a button with a mouse pointer over it, and a tooltip displayed  below the button\">\n\t\t\t\t<img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/button-pointer.png\" alt=\"Screenshot of a button with a mouse pointer over it, and no tooltip\">\n\t\t\t\t<figcaption>Figure 1<p>A tooltip is displayed below a LVTF button on hover so as not to obscure the button itself. It does however obscure content below the button (the next red button, called ~comment-zoom-content). To meet the Dismissible requirement, a user can press the Escape key to clear the tooltip without moving the mouse, as demonstrated in the second image.</p></figcaption>\n\t\t\t\t</figure>\n\t\t\t\t<figure id=\"figure-focused-button-no-tooltip\">\n\t\t\t\t<img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/button-focus-indicator.png\" alt=\"Screenshot of a button with a focus indicator on it, and no tooltip\">\n\t\t\t\t<figcaption>Figure 2<p>The button&apos;s tooltip also appears on focus and can be removed with the Escape key. The screen shot shows the same LVTF button with focus, but the tooltip has been dismissed and is no longer visible.</p></figcaption>\n\t\t\t\t</figure>\n\t\t\t"
                                },
                                {
                                    "content": "\n\t\t\t\t<h3>Example 2: Hoverable Tooltip</h3>\n\t\t\t\t<figure id=\"figure-large-pointer-tooltip\">\n\t\t\t\t<img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/button-pointer-on-tooltip.png\" alt=\"Screenshot of a button with a large mouse pointer over it, and a tooltip displayed  below the button which is obscured by the large pointer\">\n\t\t\t\t<img src=\"https://www.w3.org/WAI/WCAG22/Understanding/img/button-pointer-below-tooltip.png\" alt=\"Screenshot of a button with a tooltip below it, and a large mouse pointer at the bottom of the tooltip\">\n\t\t\t\t<figcaption>Figure 3<p>A button&apos;s tooltip is displayed directly below it on mouse hover which can easily be obscured by a large pointer.  The tooltip itself is able to be hovered so the mouse pointer can be moved down to its bottom edge in order to view the tooltip text.</p></figcaption>\n\t\t\t\t</figure>\n\t\t\t"
                                }
                            ]
                        }
                    ],
                    "id": "1.4",
                    "name": "Distinguishable"
                }
            ],
            "id": "1.",
            "name": "Perceivable "
        },
        {
            "paraText": "User interface components and navigation must be operable.",
            "guidelines": [
                {
                    "paraText": "Make all functionality available from a keyboard.",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/keyboard.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=211#keyboard",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/keyboard.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes, except where the underlying\n      function requires input that depends on the path of the user&apos;s movement and not just\n      the endpoints.\n   </p>\n   \n   \n   \n   \n   \n",
                            "id": "2.1.1",
                            "name": "Keyboard",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A drawing program allows users to create, size, position and rotate objects from the keyboard."
                                },
                                {
                                    "content": "An application that uses drag and drop also supports &quot;cut&quot; and &quot;paste&quot; or form controls to move objects."
                                },
                                {
                                    "content": "A connect-the-dots program allows the user to move between dots on a screen and use\n               the spacebar to connect the current dot to the previous one."
                                },
                                {
                                    "content": "A watercolor painting program passes as an exception because the brush strokes vary\n               depending on the speed and duration of the movements."
                                },
                                {
                                    "content": "A model helicopter flight training simulator passes as an exception because the nature\n               of the simulator is to teach real-time behavior of a model helicopter."
                                },
                                {
                                    "content": "A PDA device that is usually operated via a stylus has an optional keyboard that can\n               be attached.  The keyboard allows full Web browsing in standard fashion.  The Web\n               content is operable because it was designed to work with keyboard-only access."
                                },
                                {
                                    "content": "A search form includes a text input field followed by a submit button. The submit button itself\n               has been coded so that it does <em>not</em> receive focus, and can only be activated using a pointer input.\n               However, since keyboard users can submit the search by pressing <kbd>Enter</kbd> in the text input\n               after typing their search terms, the form passes this Success Criterion."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/no-keyboard-trap.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=212#no-keyboard-trap",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/no-keyboard-trap.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>If keyboard focus can be moved to a component of the page using a keyboard interface, then focus can be moved away from that component using only a keyboard interface,\n      and, if it requires more than unmodified arrow or tab keys or other standard exit\n      methods, the user is advised of the method for moving focus away.\n   </p>\n   \n   \n   \n",
                            "id": "2.1.2",
                            "name": "No Keyboard Trap",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A calendar widget allows users to add, remove or update items in their calendar using\n               the keyboard. The controls in the widget are part of the tab order within the Web\n               page, allowing users to tab through the controls in the widget as well as to any links\n               or controls that follow."
                                },
                                {
                                    "content": "Once a user tabs into an applet, further tabs and other keystrokes are handled by\n               the applet. Instructions describing the keystroke used to exit the applet are provided\n               prior to the applet as well as within the applet itself."
                                },
                                {
                                    "content": "A Web application brings up a dialog box. At the bottom of the dialog are two buttons,\n               Cancel and OK. When the dialog has been opened, focus is trapped within the dialog;\n               tabbing from the last control in the dialog takes focus to the first control in the\n               dialog. The dialog is dismissed by activating the Cancel button or the OK button."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/keyboard-no-exception.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=213#keyboard-no-exception",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/keyboard-no-exception.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes.\n   </p>\n   \n",
                            "id": "2.1.3",
                            "name": "Keyboard (No Exception)",
                            "level": "AAA",
                            "examples": []
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/character-key-shortcuts.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=214#character-key-shortcuts",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/character-key-shortcuts.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n  <p>If a keyboard shortcut is implemented in content using only letter (including upper- and lower-case letters), punctuation, number, or symbol characters, then at least one of the following is true:</p>\n\n  <dl>\n   \n   <dt>Turn off</dt>\n    <dd>A mechanism is available to turn the shortcut off;</dd>\n      \t\t\t\t\t\t\n   <dt>Remap</dt>\n     <dd>A mechanism is available to remap the shortcut to include one or more non-printable keyboard keys (e.g., Ctrl, Alt);</dd>\n\n    <dt>Active only on focus</dt>\n    <dd>The keyboard shortcut for a user interface component is only active when that component has focus.</dd>\n    \n  </dl>  \n",
                            "id": "2.1.4",
                            "name": "Character Key Shortcuts",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "\n\t\t\t       \n      <h3>Disable Shortcuts</h3>\n<p>A mechanism is provided to allow users to disable character-key shortcuts. The character key shortcuts are not the only way to carry out these commands. A speech user disables the shortcuts and can prevent words that are picked up by the microphone from triggering single-key shortcuts.</p>\n\t\t\t"
                                },
                                {
                                    "content": "\n\n<h3>Alternate Control</h3>\n\n<p>Keyboard-only users are in a long issues thread. While reading the thread they accidentally hit the S key, which moves focus to the search bar at the top of the document. This causes them to lose their place and train of thought. However, a mechanism is provided to allow users to change character-key shortcuts. They change the shortcut to include another key so they can avoid future interruptions.</p>\n\t\t\t"
                                }
                            ]
                        }
                    ],
                    "id": "2.1",
                    "name": "Keyboard Accessible"
                },
                {
                    "paraText": "Provide users enough time to read and use content.",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/timing-adjustable.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=221#timing-adjustable",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/timing-adjustable.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>For each time limit that is set by the content, at least one of the following is true:</p>\n   \n   <dl>\n      \n      <dt>Turn off</dt>\n      \n      <dd>\n         \n         <p>The user is allowed to turn off the time limit before encountering it; or</p>\n         \n      </dd>\n      \n      <dt>Adjust</dt>\n      \n      <dd>\n         \n         <p>The user is allowed to adjust the time limit before encountering it over a wide range\n            that is at least ten times the length of the default setting; or\n         </p>\n         \n      </dd>\n      \n      <dt>Extend</dt>\n      \n      <dd>\n         \n         <p>The user is warned before time expires and given at least 20 seconds to extend the\n            time limit with a simple action (for example, &quot;press the space bar&quot;), and the user\n            is allowed to extend the time limit at least ten times; or\n         </p>\n         \n      </dd>\n      \n      <dt>Real-time Exception</dt>\n      \n      <dd>\n         \n         <p>The time limit is a required part of a real-time event (for example, an auction),\n            and no alternative to the time limit is possible; or\n         </p>\n         \n      </dd>\n      \n      <dt>Essential Exception</dt>\n      \n      <dd>\n         \n         <p>The time limit is essential and extending it would invalidate the activity; or\n         </p>\n         \n      </dd>\n      \n      <dt>20 Hour Exception</dt>\n      \n      <dd>\n         \n         <p>The time limit is longer than 20 hours.</p>\n         \n      </dd>\n      \n   </dl>\n   \n   \n   \n",
                            "id": "2.2.1",
                            "name": "Timing Adjustable",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A Web site uses a client side time limit to help protect users who may step away from\n            their computer.   After a period of inactivity the Web page asks if the user needs\n            more time.  If it doesn&apos;t get a response &#x2013; it times out. \n         "
                                },
                                {
                                    "content": "A Web page has a field that automatically updates with the latest headlines in a rotating\n            fashion. There is an interactive control that allows the user to extend the length\n            of time between each update to as much as ten times the default. The control can be\n            operated with either a mouse or a keyboard. \n            \n         "
                                },
                                {
                                    "content": "A Web page includes an animation which includes text that appears and disappears throughout.\n            In some cases, the text is scrolling across the screen and in others, it is only displayed\n            for a short time before it fades into the background. The page includes a pause button\n            so that users who have trouble reading the text before it disappears can read it.\n         "
                                },
                                {
                                    "content": "In an auction, there is a time limit on the amount of time a user has to submit a\n            bid. Since the time limit applies to all users who want to bid on a particular item,\n            it would be unfair to extend the time limit for any one particular user. Therefore,\n            a time limit is required for this type of activity and no extension, adjustment, or\n            deactivation of the time limit is required by this Success Criterion.\n            \n         "
                                },
                                {
                                    "content": "An on-line ticket-purchasing site gives the user two minutes to confirm a purchase\n            before the seats are returned to the general pool. Because tickets on such sites can\n            sell out quickly, holding a ticket longer than that may invalidate the nature of the\n            site, so this is a case in which the timing is essential and cannot be extended without\n            invalidating the activity. However, the site does move as much of the process out\n            of the time-critical period as possible, for instance allowing users to provide necessary\n            information like name, payment method, etc., before entering the time-critical stage.\n            \n         "
                                },
                                {
                                    "content": "A ticket-purchasing site allows the user two minutes to confirm purchase of selected\n            seats, but warns the user when their time is almost out and allows the user to extend\n            this time limit some number of times with a simple action such as clicking a &quot;Extend\n            time limit&quot; button.\n            \n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/pause-stop-hide.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=222#pause-stop-hide",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/pause-stop-hide.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>For moving, blinking, scrolling, or auto-updating information, all of the following are true:\n   </p>\n   \n   <dl>\n      \n      <dt>Moving, blinking, scrolling</dt>\n      \n      <dd>\n         \n         <p>For any moving, blinking or scrolling information that (1) starts automatically, (2)\n            lasts more than five seconds, and (3) is presented in parallel with other content,\n            there is a mechanism for the user to pause, stop, or hide it unless the movement, blinking, or scrolling is part of an activity\n            where it is essential; and\n         </p>\n         \n      </dd>\n      \n      <dt>Auto-updating</dt>\n      \n      <dd>\n         \n         <p>For any auto-updating information that (1) starts automatically and (2) is presented\n            in parallel with other content, there is a mechanism for the user to pause, stop,\n            or hide it or to control the frequency of the update unless the auto-updating is part\n            of an activity where it is essential.\n         </p>\n         \n      </dd>\n      \n   </dl>\n   \n   \n   \n   \n   \n   \n   \n   \n   \n",
                            "id": "2.2.2",
                            "name": "Pause, Stop, Hide",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A Web site helps users understand &apos;how things work&apos; through animations that demonstrate\n               processes. Animations have &quot;pause&quot; and &quot;restart&quot; buttons."
                                },
                                {
                                    "content": "A stock ticker has &quot;pause&quot; and &quot;restart&quot; buttons. Pausing the ticker causes it to\n               pause on the currently displayed stock. Restarting causes the ticker to resume from\n               the stopped point but with a notice that the display is delayed. Since the intent\n               of the stock ticker is usually to provide realtime information, there might also be\n               a button that would advance the ticker to the most recently traded stock."
                                },
                                {
                                    "content": "One party can pause the game without invalidating the competitive aspect of it."
                                },
                                {
                                    "content": "An advertisement blinks to get viewers attention but stops after 5 seconds"
                                },
                                {
                                    "content": "A form blinks an arrow near the submit button if a user finishes filling out the form\n               but does not activate the submit button. The blinking stops after 5 seconds."
                                },
                                {
                                    "content": "An animation runs in the upper portion of the page but has a &quot;freeze animation&quot; button\n               near the bottom of the animation."
                                },
                                {
                                    "content": "A preloader animation is shown on a page which requires a certain percentage of a\n               large file to be downloaded before playback can begin. The animation is the only content\n               on the page and instructs the user to please wait while the video loads. Because the\n               moving content is not presented in parallel with other content, no mechanism to pause,\n               stop or hide it needs to be provided, even though the animation may run for more than\n               5 seconds for users with slower connections."
                                },
                                {
                                    "content": "A site requires that all users view a 15 second advertisement before they can access\n               free content available from their site. Because viewing the advertisement is a requirement\n               for all users and because it is not presented in parallel with other content, no mechanism\n               to pause, stop or hide it needs to be provided."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/no-timing.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=223#no-timing",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/no-timing.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Timing is not an essential part of the event or activity presented by the content, except for non-interactive\n      synchronized media and real-time events.\n   </p>\n   \n",
                            "id": "2.2.3",
                            "name": "No Timing",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "Rather than calibrating an on-line test using a time limit, the test is calibrated\n               based on scores when users have no time limits."
                                },
                                {
                                    "content": "One party can pause the game without invalidating the competitive aspect of it."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/interruptions.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=224#interruptions",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/interruptions.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Interruptions can be postponed or suppressed by the user, except interruptions involving\n      an emergency.\n   </p>\n   \n",
                            "id": "2.2.4",
                            "name": "Interruptions",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "The preferences page of a Web portal includes an option to postpone all updates and\n               alerts until the end of the current session, except for alerts concerning emergencies."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/re-authenticating.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=225#re-authenticating",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/re-authenticating.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>When an authenticated session expires, the user can continue the activity without\n      loss of data after re-authenticating.\n   </p>\n   \n",
                            "id": "2.2.5",
                            "name": "Re-authenticating",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "A user with extremely limited use of the hands is logged into a shopping site. It\n               takes so long to enter credit card information into the application that a time limit\n               occurs while the user is performing the checkout process. When the user returns to\n               the checkout process and submits the form, the site returns a login screen to re-authenticate.\n               After the user logs in, the check out process is restored with the same information\n               and at the same stage. The user did not lose any data because the server had temporarily\n               accepted and stored the submission even though the session had timed out and restored\n               the user to the same state after re-authentication was completed."
                                },
                                {
                                    "content": "An email program has an authentication time-out after 30 minutes. The program prompts\n               the user several minutes before the time-out occurs and provides a link to open a\n               new window in order to re-authenticate. The original window with the in-progress email\n               remains intact and, after re-authentication, the user may send that data."
                                },
                                {
                                    "content": "A long questionnaire provided within a single Web page has information at the beginning\n               that indicates that the session will time out after 15 minutes. The user is also informed\n               that the questionnaire can be saved at any point and completed at a later time. Within\n               the Web page there are several buttons provided to save the partially completed form.\n               In addition, with JavaScript in the list of accessibility-supported content technologies\n               that are relied upon, the user can elect to be alerted via a pop-up if the session\n               is close to timing out."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/timeouts.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=226#timeouts",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/timeouts.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   <p>Users are warned of the duration of any user inactivity that could cause data loss, unless the data is preserved for more than 20 hours when the user does not take any actions.</p>\n  \n\n  \n",
                            "id": "2.2.6",
                            "name": "Timeouts",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "While making a purchase on an e-commerce Web site, the information input by the user is stored for more than 20 hours. This helps ensure that if they need to stop working for a while that they are more likely to be able to continue the purchase when they return."
                                },
                                {
                                    "content": "A web application allowing people to file tax returns provides a notice that the application will time out for security purposes. The notice indicates that a lack of activity for a continuous period of time that is greater than an hour will trigger initiate the time out process."
                                },
                                {
                                    "content": "An online contact form does not implement any type of time out process. Information entered into the contact form can be submitted at any time and would only be lost if the user closes their browser window."
                                }
                            ]
                        }
                    ],
                    "id": "2.2",
                    "name": "Enough Time"
                },
                {
                    "paraText": "Do not design content in a way that is known to cause seizures or physical reactions.",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/three-flashes-or-below-threshold.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=231#three-flashes-or-below-threshold",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/three-flashes-or-below-threshold.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Web pages do not contain anything that flashes more than three times in any one second period,\n      or the flash is below the general flash and red flash thresholds.\n   </p>\n   \n   \n   \n",
                            "id": "2.3.1",
                            "name": "Three Flashes or Below Threshold",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "\n            A Web site has video of muzzle flash of machine gun fire, but limits the size of the\n            flashing image to a small portion of the screen below the flash threshold size.\n            \n            \n         "
                                },
                                {
                                    "content": "A movie with a scene involving very bright lightning flashes is edited so that the\n            lightning only flashes three times in any one second period. \n            \n            \n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/three-flashes.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=232#three-flashes",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/three-flashes.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Web pages do not contain anything that flashes more than three times in any one second period.\n   </p>\n   \n",
                            "id": "2.3.2",
                            "name": "Three Flashes",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "A movie with a scene involving very bright lightning flashes is edited so that the\n            lightning only flashes three times in any one second period. \n            \n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/animation-from-interactions.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=233#animation-from-interactions",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/animation-from-interactions.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n  <p>Motion animation triggered by interaction can be disabled, unless the animation is essential to the functionality or the information being conveyed.</p>\n   \t\t\t\t\n",
                            "id": "2.3.3",
                            "name": "Animation from Interactions",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "<strong>Parallax scrolling with option to turn off unnecessary motion globally:</strong> \n            <ul>\n              <li>A site includes extra animations when the user scrolls. Decorative elements move in and out of view horizontally when the essential page content is scrolled vertically. A control at the top of each page allows the user to turn off unnecessary animations. The ability to turn off non-essential animations is a site-wide setting.</li>\n            </ul>\n        "
                                },
                                {
                                    "content": "A site includes extra animations when the user scrolls. Decorative elements move in and out of view horizontally when the essential page content is scrolled vertically. A control at the top of each page allows the user to turn off unnecessary animations. The ability to turn off non-essential animations is a site-wide setting."
                                },
                                {
                                    "content": "<strong>Transitions that support the reduce motion preference:</strong> \n            <ul>\n              <li>A site includes a non-essential transition when loading new content. The transition is a page-flipping animation that respects the reduce-motion CSS media query. When the user enables the reduce motion preference, the page-flipping animation is turned off.              </li>\n            </ul>\n          "
                                },
                                {
                                    "content": "A site includes a non-essential transition when loading new content. The transition is a page-flipping animation that respects the reduce-motion CSS media query. When the user enables the reduce motion preference, the page-flipping animation is turned off.              "
                                },
                                {
                                    "content": "<strong>Essential animation:</strong> \n            <ul>\n              <li>A web application provides a feature to author animated sequences. As part of this tool the author needs to preview the animation.</li>\n            </ul>\n        "
                                },
                                {
                                    "content": "A web application provides a feature to author animated sequences. As part of this tool the author needs to preview the animation."
                                }
                            ]
                        }
                    ],
                    "id": "2.3",
                    "name": "Seizures and Physical Reactions"
                },
                {
                    "paraText": "Provide ways to help users navigate, find content, and determine where they are.",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/bypass-blocks.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=241#bypass-blocks",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/bypass-blocks.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>A mechanism is available to bypass blocks of content that are repeated on multiple Web pages.\n   </p>\n   \n",
                            "id": "2.4.1",
                            "name": "Bypass Blocks",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A news organization&apos;s home page contains a main story in the middle of the page, surrounded\n            by many blocks and sidebars for advertising, searching, and other services. There\n            is a link at the top of the page that jumps to the main story. Without using this\n            link, a keyboard user needs to tab through approximately 40 links to reach the main\n            story; the screen reader user has to listen to 200 words; and the screen magnifier\n            user must search around for the location of the main body.\n         "
                                },
                                {
                                    "content": "An e-commerce website includes a long list of filters prior to the search results listing. \n            A link above the list enables users to skip the filters and get to the product results quickly."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/page-titled.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=242#page-titled",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/page-titled.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Web pages have titles that describe topic or purpose.\n   </p>\n   \n",
                            "id": "2.4.2",
                            "name": "Page Titled",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "\n            <p>The title of <a href=\"./\">Understanding WCAG 2.1 </a>\n               is &quot;Understanding WCAG 2.1.&quot;</p>\n            <ul>\n               <li>The introduction page has the title &quot;Introduction to Understanding WCAG 2.0.&quot;</li>\n               <li>Major sections of the document are pages titled &quot;Understanding Guideline X&quot; and &quot;Understanding\n                  Success Criterion X.&quot; \n               </li>\n               <li>Appendix A has the title &quot;Glossary.&quot;</li>\n               <li>Appendix B has the title &quot;Acknowledgements.&quot;</li>\n               <li>Appendix C has the title &quot;References.&quot;</li>\n            </ul>\n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/focus-order.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=243#focus-order",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/focus-order.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>If a Web page can be navigated sequentially and the navigation sequences affect meaning or operation, focusable components receive\n      focus in an order that preserves meaning and operability.\n   </p>\n   \n",
                            "id": "2.4.3",
                            "name": "Focus Order",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "\n            \n            <p>An HTML Web page is created with the left hand navigation occurring in the HTML after\n               the main body content, and styled with CSS to appear on the left hand side of the\n               page. This is done to allow focus to move to the main body content first without requiring\n               <code class=\"language-html\">tabindex</code> attributes or JavaScript.\n            </p>\n            \n            \n            \n         "
                                },
                                {
                                    "content": "\n            \n            <p>The following example <strong>fails to meet the Success Criterion</strong>:</p>\n            \n            <p>A company&apos;s Web site includes a form that collects marketing data and allows users\n               to subscribe to several newsletters published by the company. The section of the form\n               for collecting marketing data includes fields such as name, street address, city,\n               state or province, and postal code. Another section of the form includes several checkboxes\n               so that users can indicate newsletters they want to receive. However, the tab order\n               for the form skips between fields in different sections of the form, so that focus\n               moves from the name field to a checkbox, then to the street address, then to another\n               checkbox.</p>\n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/link-purpose-in-context.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=244#link-purpose-in-context",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/link-purpose-in-context.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>The purpose of each link can be determined from the link text alone or from the link text together with its\n      programmatically determined link context, except where the purpose of the link would be ambiguous to users in general.\n   </p>\n   \n",
                            "id": "2.4.4",
                            "name": "Link Purpose (In Context)",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A page contains the sentence &quot;There was much bloodshed during the Medieval period\n               of history.&quot; Where &quot;Medieval period of history&quot; is a link."
                                },
                                {
                                    "content": "A page contains the sentence &quot;Learn more about the Government of Ireland&apos;s Commission\n               on Electronic Voting at Go Vote!&quot; where &quot;Go Vote!&quot; is a link."
                                },
                                {
                                    "content": "An icon of a voting machine and the text &quot;Government of Ireland&apos;s Commission of Electronic\n               Voting&quot; are combined to make a single link. The alt text for the icon is null, since\n               the purpose of the link is already described by the text of the link next to the icon."
                                },
                                {
                                    "content": "A list of books is available in three formats: HTML, PDF, and mp3 (a recording of\n               a person reading the book). To avoid hearing the title of each book three times (once\n               for each format), the first link for each book is the title of the book, the second\n               link says &quot;PDF&quot; and the third says, &quot;mp3.&quot;"
                                },
                                {
                                    "content": "A Web page contains a collection of news articles. The main page lists the first few\n               sentences of each article, followed by a &quot;Read more&quot; link. A screen reader command\n               to read the current paragraph provides the context to interpret the purpose of the\n               link."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/multiple-ways.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=245#multiple-ways",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/multiple-ways.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>More than one way is available to locate a Web page within a set of Web pages except where the Web Page is the result of, or a step in, a process.\n   </p>\n   \n",
                            "id": "2.4.5",
                            "name": "Multiple Ways",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "A large food processing company provides a site containing recipes created using its\n               products. The site provides a search mechanism to search for recipes using a particular\n               ingredient. In addition, it provides a list box that lists several categories of foods.\n               A user may type &quot;soup&quot; in to the search engine or may select &quot;soup&quot; from the list\n               box to go to a page with a list of recipes made from the company&apos;s soup products."
                                },
                                {
                                    "content": "A local hair salon has created a Web site to promote its services. The site contains\n               only five Web pages. There are links on each Web page to sequentially move forward\n               or backward through the Web pages. In addition, each Web page contains a list of links\n               to reach each of the other Web pages."
                                },
                                {
                                    "content": "An on-line banking site allows fund transfer between accounts via the Web. There is\n               no other way to locate the confirmation of fund transfer until the account owner completes\n               the transfer."
                                },
                                {
                                    "content": "A search engine provides the search results based on user input. There is no other\n               way to locate the search results except to perform the search process itself."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/headings-and-labels.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=246#headings-and-labels",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/headings-and-labels.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Headings and labels describe topic or purpose.\n   </p>\n   \n",
                            "id": "2.4.6",
                            "name": "Headings and Labels",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "The home page of a news site lists the headlines for the top stories of the hour.\n               Under each heading are the first 35 words of the story and a link to the full article.\n               Each headline gives a clear idea of the article&apos;s subject."
                                },
                                {
                                    "content": "A guide on writing contains the following section titles: <q>How To Write Well</q>,\n               <q>Cut Out Useless Words</q>, <q>Identify Unnecessary Words</q>, and so on.\n               The section headings are clear and concise and the structure of the information is\n               reflected in the structure of the headings."
                                },
                                {
                                    "content": "A Web site contains papers from a conference. Submissions to the conference are required\n               to have the following organization: <q>Summary</q>, <q>Introduction</q>, [other sections unique\n               to this article], <q>Conclusion</q>, <q>Author Biography</q>, <q>Glossary</q>, and <q>Bibliography</q>.\n               The title of each Web page clearly identifies the article it contains, creating a useful balance\n               between the uniqueness of the articles and the consistency of the section headings."
                                },
                                {
                                    "content": "A form asks for the name of the user. It consists of two input fields to ask for the first\n               and last name. The first field is labeled <q>First name</q>, the second is labeled <q>Last name</q>."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/focus-visible.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=247#focus-visible",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/focus-visible.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Any keyboard operable user interface has a mode of operation where the keyboard focus\n      indicator is visible.\n   </p>\n   \n",
                            "id": "2.4.7",
                            "name": "Focus Visible",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "When text fields receive focus, a vertical bar is displayed in the field, indicating\n            that the user can insert text, OR all of the text is highlighted, indicating that\n            the user can type over the text.\n         "
                                },
                                {
                                    "content": "When a user interface control receives focus, a visible border is displayed around\n            it.\n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/location.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=248#location",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/location.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Information about the user&apos;s location within a set of Web pages is available.\n   </p>\n   \n",
                            "id": "2.4.8",
                            "name": "Location",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "A research group is part of an educational department at a university. The group&apos;s\n               home page links to the department home page and the university&apos;s home page."
                                },
                                {
                                    "content": "A portal Web site organizes topics into categories. As the user navigates through\n               categories and subcategories, a breadcrumb trail shows the current location in the\n               hierarchy of categories. Each page also contains a link to the portal home page."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/link-purpose-link-only.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=249#link-purpose-link-only",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/link-purpose-link-only.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>A mechanism is available to allow the purpose of each link to be identified from link text alone,\n      except where the purpose of the link would be ambiguous to users in general.\n   </p>\n   \n",
                            "id": "2.4.9",
                            "name": "Link Purpose (Link Only)",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "An icon of a voting machine and the text &quot;Government of Ireland&apos;s Commission of Electronic\n               Voting&quot; are combined to make a single link."
                                },
                                {
                                    "content": "A list of books is available in three formats: HTML, PDF, and mp3 (a recording of\n               a person reading the book). The title of the book is followed by links to the different\n               formats. The rendered text for each link is just the format type, but the text associated\n               with each link includes the title as well as the format; for instance, &quot;Gulliver&apos;s\n               Travels, MP3.&quot;"
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/section-headings.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=2410#section-headings",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/section-headings.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Section headings are used to organize the content.\n   </p>\n   \n   \n   \n   \n   \n",
                            "id": "2.4.10",
                            "name": "Section Headings",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "A menu contains different sections for different courses. Each section has a heading:\n            Appetizers, Salad, Soup, Entree, Dessert.\n         "
                                },
                                {
                                    "content": "A Web application contains a settings page that is divided into groups of related\n            settings. Each section contains a heading describing the class of settings.\n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/focus-not-obscured-minimum.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=2411#focus-not-obscured-minimum",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/focus-not-obscured-minimum.html#examples"
                            },
                            "contentMarkup": "\n   \n    \n    \n    \n\t<p class=\"change\">[New]</p>\n    \n    <p>When a user interface component receives keyboard focus, the component is not entirely hidden due to author-created content.</p>\n\n    \n\n    \n\n ",
                            "id": "2.4.11",
                            "name": "Focus Not Obscured (Minimum)",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "A page has a sticky footer (attached to the bottom of the viewport). When tabbing down the page the focused item is not completely visually obscured by the footer because content in the viewport scrolls up to always display the item with keyboard focus using <a href=\"https://www.w3.org/TR/css-scroll-snap/#propdef-scroll-padding\" rel=\"nofollow\">scroll padding</a>."
                                },
                                {
                                    "content": "A page has a full-width cookie approval dialog. The dialog is modal, preventing access to the other controls in the page until it has been dismissed. Focus is not obscured because the major portion of the cookie approval dialog remains on screen (until selections are made and submitted),  and so the major portion of the keyboard focus indicator remains visible."
                                },
                                {
                                    "content": "A notification is implemented as a sticky header and the keyboard focus is moved to the notification so at least part of the focus indicator is in view. The notification disappears when it loses focus so it does not obscure any other controls, and part of the prior keyboard focus indicator is visible."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/focus-not-obscured-enhanced.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=2412#focus-not-obscured-enhanced",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/focus-not-obscured-enhanced.html#examples"
                            },
                            "contentMarkup": "\n   \n    \n    \n    \n\t<p class=\"change\">[New]</p>\n    \n    <p>When a user interface component receives keyboard focus, no part of the component is hidden by author-created content.</p>\n\n    \n ",
                            "id": "2.4.12",
                            "name": "Focus Not Obscured (Enhanced)",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "A page has a sticky footer (attached to the bottom of the viewport). When tabbing down the page the focused item is not at all obscured by the footer because content in the viewport scrolls up to always display the item with keyboard focus using <a href=\"https://www.w3.org/TR/css-scroll-snap/#propdef-scroll-padding\" rel=\"nofollow\">scroll padding</a>."
                                },
                                {
                                    "content": "A page has a large (30% wide) cookie approval dialog. The dialog is modal, preventing access to the other controls in the page until it has been dismissed. Focus is not obscured because the cookie approval dialog (including the focus indicator) remains on screen until selections are made and submitted."
                                },
                                {
                                    "content": "A notification is implemented as a sticky header and the keyboard focus is moved to the notification. The notification disappears when it loses focus, and does not obscure any other controls (including the focus indicator visible prior to the notification)."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/focus-appearance.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=2413#focus-appearance",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/focus-appearance.html#examples"
                            },
                            "contentMarkup": "\n   \n    \n    \n    \n\t<p class=\"change\">[New]</p>\n    \n    <p>When the keyboard focus indicator is visible, an area of the focus indicator meets all the following:</p>\n    <ul>\n        <li>is at least as large as the area of a 2 CSS pixel thick perimeter of the unfocused component or sub-component, and</li>\n        <li>has a contrast ratio of at least 3:1 between the same pixels in the focused and unfocused states.</li>\n    </ul>\n\n    <p>Exceptions:</p>\n    <ul>\n      <li>The focus indicator is determined by the user agent and cannot be adjusted by the author, or</li>\n        <li>The focus indicator and the indicator&apos;s background color are not modified by the author.</li>\n    </ul>\n    \n    \n\n    \n\n    \n\n ",
                            "id": "2.4.13",
                            "name": "Focus Appearance",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "When links receive focus, an outline is displayed around the link that contrasts with the background\n                adjacent to the link."
                                },
                                {
                                    "content": "When buttons receive focus, an outline is displayed within the button (around the text) that contrasts\n                with the button&apos;s background."
                                },
                                {
                                    "content": "When text fields receive focus, an outline is displayed around the field, indicating that the input has\n                focus."
                                },
                                {
                                    "content": "When radio buttons receive focus, an outline is displayed around the control, indicating that the input\n                has focus."
                                }
                            ]
                        }
                    ],
                    "id": "2.4",
                    "name": "Navigable"
                },
                {
                    "paraText": "Make it easier for users to operate functionality through various inputs beyond keyboard.",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/pointer-gestures.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=251#pointer-gestures",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/pointer-gestures.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   <p>All functionality that uses multipoint or path-based gestures for operation can be operated with a single pointer without a path-based gesture, unless a multipoint or path-based gesture is essential.</p>\n   \t\t\t\t\t\n   \n\t\n",
                            "id": "2.5.1",
                            "name": "Pointer Gestures",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "<p>A web site includes a map view that supports the pinch gesture to zoom into the map content. User interface controls offer the operation using plus and minus buttons to zoom in and out.</p>"
                                },
                                {
                                    "content": "<p>A web site includes a map view that supports the pinch gesture to zoom into the map content. As an single-pointer alternative, the map also allows users to double-tap, hold, and then move the pointer up or down to zoom in or out.</p>"
                                },
                                {
                                    "content": "<p>A news site has a horizontal content slider with hidden news teasers that can moved into the viewport via a fast horizontal swipe/flicking motion. It also offers forward and backward arrow buttons for single-point activation to navigate to adjacent slider content.</p>"
                                },
                                {
                                    "content": "<p>A kanban widget with several vertical areas representing states in a defined process allows the user to right- or left-swipe elements to move them to an adjacent silo. The user can also accomplish this by selecting the element with a single tap or click, and then activating an arrow button to move the selected element.</p>"
                                },
                                {
                                    "content": "<p>A custom slider requires movement in a strict left/right direction when operated by dragging the thumb control. Buttons on both sides of the slider increment and decrement the selected value and update the thumb position.</p>"
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/pointer-cancellation.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=252#pointer-cancellation",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/pointer-cancellation.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   <p>For functionality that can be operated using a single pointer, at least one of the following is true:</p>\n   \t\t\t\t\t\n   <dl>\n   \n   <dt>No Down-Event</dt>\n     <dd>The down-event of the pointer is not used to execute any part of the function;</dd>\n      \t\t\t\t\t\t\n   <dt>Abort or Undo</dt>\n     <dd>Completion of the function is on the up-event, and a mechanism is available to abort the function before completion or to undo the function after completion;</dd>\n      \t\t\t\t\t\t\n   <dt>Up Reversal</dt>\n     <dd>The up-event reverses any outcome of the preceding down-event;</dd>\n      \t\t\t\t\t\t\n   <dt>Essential</dt>\n     <dd>Completing the function on the down-event is essential.</dd>\n      \t\t\t\t\t\t\n   </dl>\n   \n   \t\t\t\t\t\n  \n\t\n",
                            "id": "2.5.2",
                            "name": "Pointer Cancellation",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "For interface elements that have a single tap or long press as input, the corresponding event is triggered when the finger is lifted inside that element."
                                },
                                {
                                    "content": "A drag-and-drop interface allows users to sort vertically stacked cards by picking up one card with the pointer (down-event), move it to a new position, and insert it at the new location when the pointer is released (up-event). Releasing the pointer outside the drop target area reverts the action, i.e., it moves the card back to the old position before the interaction started."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/label-in-name.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=253#label-in-name",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/label-in-name.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n\t\n  <p>For user interface components with labels that include text or images of text, the name contains the text that is presented visually.</p>\n\n  \n\t\n",
                            "id": "2.5.3",
                            "name": "Label in Name",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "<strong>Accessible name matches visible label:</strong> The accessible name and visible label of a control match."
                                },
                                {
                                    "content": "<strong>Accessible name starts with visible label:</strong> The accessible name &quot;Search for a value&quot; begins with the text of the visible label, &quot;Search&quot;."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/motion-actuation.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=254#motion-actuation",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/motion-actuation.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n  \n   \n   \t\t\t\t\t\n   <p>Functionality that can be operated by device motion or user motion can also be operated by user interface components and responding to the motion can be disabled to prevent accidental actuation, except when:</p>\n   \n   <dl>\n   \n   <dt>Supported Interface</dt>\n     <dd>The motion is used to operate functionality through an accessibility supported interface;</dd>\n   \n   <dt>Essential</dt>\n   <dd>The motion is essential for the function and doing so would invalidate the activity.</dd>\n   \n   </dl>\n   \t\t\t\t\n",
                            "id": "2.5.4",
                            "name": "Motion Actuation",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A user can choose an application setting which turns off Shake to Undo and other motion-activated features."
                                },
                                {
                                    "content": "After text is input in a field, shaking a device shows a dialog offering users to undo the input. A cancel button next to the text field offers the same functionality."
                                },
                                {
                                    "content": "A user can tilt a device to advance to the next or a previous page. Buttons are also provided to perform the same function."
                                },
                                {
                                    "content": "A user can move or pan a device to change the view in an interactive photo. A control is also available to perform these same functions."
                                },
                                {
                                    "content": "A user can gesture towards the device to navigate content. Controls are also available to navigate."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/target-size-enhanced.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=255#target-size-enhanced",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/target-size-enhanced.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n  <p>The size of the target for pointer inputs is at least 44 by 44 CSS pixels except when:</p>\n<dl>\n\t<dt>Equivalent</dt> \n  <dd>The target is available through an equivalent link or control on the same page that is at least 44 by 44 CSS pixels;</dd>\n\t<dt>Inline</dt> \n  <dd>The target is in a sentence or block of text;</dd>\n\t<dt>User Agent Control</dt> \n  <dd>The size of the target is determined by the user agent and is not modified by the author;</dd>\n\t<dt>Essential</dt> \n  <dd>A particular presentation of the target is essential to the information being conveyed.</dd>\n</dl>  \n   \n",
                            "id": "2.5.5",
                            "name": "Target Size (Enhanced)",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "<strong>Example 1: Buttons</strong><br> Three buttons are on-screen and the touch target area of each button is 44 by 44 CSS pixels."
                                },
                                {
                                    "content": "<strong>Example 2: Equivalent target</strong><br> Multiple targets are provided on the page that perform the same function. One of the targets is 44 by 44 CSS pixels. The other targets do not have a minimum touch target of 44 by 44 CSS pixels."
                                },
                                {
                                    "content": "<strong>Example 3: Anchor Link</strong><br> The target is an in-page link and the target is less than 44 by 44 CSS pixels."
                                },
                                {
                                    "content": "<strong>Example 4: Text Link in a paragraph</strong><br> Links within a paragraph of text have varying touch target dimensions. Links within\n           paragraphs of text do no need to meet the 44 by 44 CSS pixels requirements."
                                },
                                {
                                    "content": "<strong>Example 5: Text Link in a sentence</strong><br> A text link that is in a sentence is excluded and does not need to meet the 44 by 44 CSS pixel requirement. If the text link is the full sentence, then the text link target touch area does need to meet the 44 by 44 CSS pixels."
                                },
                                {
                                    "content": "<strong>Example 6: Footnote</strong><br> A footnote link at the end of a sentence does not need to meet the 44 by 44 CSS pixels requirements. The footnote at the end of the sentence is considered to be part of the sentence."
                                },
                                {
                                    "content": "<strong>Example 7: Help icon</strong><br> A help icon within or at the end of a sentence does not need to meet the 44 by 44 CSS pixels requirements. The icon at the end of the sentence is considered to be part of the sentence."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/concurrent-input-mechanisms.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=256#concurrent-input-mechanisms",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/concurrent-input-mechanisms.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n  <p>Web content does not restrict use of input modalities available on a platform except where the restriction is essential, required to ensure the security of the content, or required to respect user settings.</p>   \t\t\t\t\t\n",
                            "id": "2.5.6",
                            "name": "Concurrent Input Mechanisms",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "A user with mobility impairment pairs a mouse and keyboard to a mobile phone with a touchscreen. The phone can thereafter be operated by those input devices and the content does not accept the touchscreen as the only input mechanism."
                                },
                                {
                                    "content": "On a touch-enabled laptop with coarse precision, people who have difficulty activating a small target because of hand tremors, limited dexterity or other reasons are still able to interact with content using their keyboard and trackpad."
                                },
                                {
                                    "content": "A user starts interacting with a page using a desktop keyboard, and then attaches a secondary touch-enabled monitor. Content can be operated using this newly added input mechanism and does not assume that the keyboard, the first input mechanism it detected, is the only one in use."
                                },
                                {
                                    "content": "A speech input user navigates content using voice commands which translate to simulate mouse (and keyboard) commands. When talking with a colleague, however, the user turns speech recognition off and uses the mouse instead."
                                },
                                {
                                    "content": "A user opens a menu with a mouse, and then navigates between the menu items with arrow keys."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/dragging-movements.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=257#dragging-movements",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/dragging-movements.html#examples"
                            },
                            "contentMarkup": "\n   \n    \n    \n    \n\t<p class=\"change\">[New]</p>\n    \n  <p>All functionality that uses a dragging movement for operation can be achieved by a single pointer without dragging, unless dragging is essential or the functionality is determined by the user agent and not modified by the author.</p>\n    \n   \n ",
                            "id": "2.5.7",
                            "name": "Dragging Movements",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "A map allows users to drag the view of the map around, and the map has up/down/left/right buttons to move the view as well."
                                },
                                {
                                    "content": "A sortable list of elements may, after tapping or clicking on a list element, provide adjacent controls for moving the element up or down in the list by simply tapping or clicking on those controls."
                                },
                                {
                                    "content": "A taskboard that allows users to drag and drop items between columns also provides an additional pop-up menu after tapping or clicking on items for moving the selected element to another column by tapping or clicking on pop-up menu entries."
                                },
                                {
                                    "content": "A radial control widget (color wheel) where the value can be set by dragging the marker for the currently selected color to another position, also allows picking another color value by tapping or clicking on another place in the color wheel."
                                },
                                {
                                    "content": "A linear slider control widget, where the value can be set by dragging the visual indicator (thumb) showing the current value, allows tapping or clicking on any point of the slider track to change the value and set the thumb to that position. "
                                },
                                {
                                    "content": "A widget where you can drag a gift to one person in a photo of a group of people also has a menu alternative where users can select the person that should receive the gift from the menu."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/target-size-minimum.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=258#target-size-minimum",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/target-size-minimum.html#examples"
                            },
                            "contentMarkup": "\n   \n    \n    \n    \n\t<p class=\"change\">[New]</p>\n    \n    <p>The size of the target for pointer inputs is at least 24 by 24 CSS pixels, except where:</p>\n    <ul>\n        <li><strong>Spacing:</strong> Undersized targets (those less than 24 by 24 CSS pixels) are positioned so that if a 24 CSS pixel diameter circle is centered on the bounding box of each, the circles do not intersect another target or the circle for another undersized target;</li>\n        <li><strong>Equivalent:</strong> The function can be achieved through a different control on the same page that meets this criterion;</li>\n        <li><strong>Inline:</strong> The target is in a sentence or its size is otherwise constrained by the line-height of non-target text;</li>\n        <li><strong>User agent control:</strong> The size of the target is determined by the user agent and is not modified by the author;</li>\n        <li><strong>Essential:</strong> A particular presentation of the target is essential or is legally required for the information being conveyed.</li>\n    </ul>\n    \n    \n\n",
                            "id": "2.5.8",
                            "name": "Target Size (Minimum)",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "Three buttons are on-screen and the target size of each button is 24 by 24 CSS pixels. Since the target size itself is 24 by 24 CSS pixels, no additional spacing is required, the Success Criterion passes."
                                },
                                {
                                    "content": "A row of buttons, each of which has a horizontal width of more than 24 CSS pixels, a height of only 20 CSS pixels, and vertical margin of 4 CSS pixels above and below the row of buttons. Since there is sufficient spacing both above and below the row of buttons, the Success Criterion passes."
                                },
                                {
                                    "content": "Links within a paragraph of text have varying target dimensions. Links within paragraphs of text do not need to meet the 24 by 24 CSS pixels requirements, so the Success Criterion passes."
                                }
                            ]
                        }
                    ],
                    "id": "2.5",
                    "name": "Input Modalities"
                }
            ],
            "id": "2.",
            "name": "Operable "
        },
        {
            "paraText": "Information and the operation of the user interface must be understandable.",
            "guidelines": [
                {
                    "paraText": "Make text content readable and understandable.",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/language-of-page.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=311#language-of-page",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/language-of-page.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>The default human language of each Web page can be programmatically determined.\n   </p>\n   \n",
                            "id": "3.1.1",
                            "name": "Language of Page",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A Web page produced in Germany and written in HTML includes content in both German\n               and English, but most of the content is in German. The default human language is identified\n               as German (de) by the lang attribute on the html element."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/language-of-parts.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=312#language-of-parts",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/language-of-parts.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>The human language of each passage or phrase in the content can be programmatically determined except for proper names, technical terms, words of indeterminate language, and words\n      or phrases that have become part of the vernacular of the immediately surrounding\n      text.\n   </p>\n   \n",
                            "id": "3.1.2",
                            "name": "Language of Parts",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "  \n            <p>  \t\t\t\t\t\t\t\t       \n               <strong>A German phrase in an English sentence.</strong>\t\t\t\t\t\t\t     \n            </p>\n            <p>In the sentence, &quot;He maintained that the DDR (German Democratic Republic) was just\n               a &apos;<span lang=\"de\">Treppenwitz der Weltgeschichte</span>&apos;,&quot; the German phrase &apos;<span lang=\"de\">Treppenwitz der Weltgeschichte</span>&apos; is marked as German. Depending on the markup language, English may either be marked\n               as the language for the entire document except where specified, or marked at the paragraph\n               level. When a screen reader encounters the German phrase, it changes pronunciation\n               rules from English to German to pronounce the word correctly.\n            </p>\n         "
                                },
                                {
                                    "content": "\n            <p>  \t\t\t\t\t\t\t\t       \n               <strong>Alternative language links</strong>\t\t\t\t\t\t\t     \n            </p>\n            <p>An HTML Web page includes links to versions of the page in other languages (e.g.,\n               <span lang=\"de\">Deutsch</span>, <span lang=\"fr\">Fran&#xE7;ais</span>, <span lang=\"nl\">Nederlands</span>, <span lang=\"ca\">Catalan</span>, etc.). The text of each link is the name of the language, in that language. The language of each link is indicated via a <code class=\"att\">lang</code> attribute.\n            </p>\n<pre xml:space=\"preserve\"><code>&lt;ul&gt;\n  &lt;li&gt;&lt;a href=&quot;...&quot; lang=&quot;de&quot;&gt;Deutsch&lt;/a&gt;&lt;/li&gt;\n  &lt;li&gt;&lt;a href=&quot;...&quot; lang=&quot;it&quot;&gt;Italiano&lt;/a&gt;&lt;/li&gt;\n  &lt;li&gt;&lt;a href=&quot;...&quot; lang=&quot;fr&quot;&gt;Fran&#xE7;ais&lt;/a&gt;&lt;/li&gt;\n  ...\n  &lt;li&gt;&lt;a href=&quot;...&quot; lang=&quot;zh-hant&quot;&gt;&#x7E41;&#x9AD4;&#x4E2D;&#x6587;&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;</code></pre>\n         "
                                },
                                {
                                    "content": "\n            <p>  \t\t\t\t\t\t\t\t       \n               <strong>&quot;Podcast&quot; used in a French sentence.</strong>\t\t\t\t\t\t\t     \n            </p>\n            <p>Because &quot;podcast&quot; is part of the vernacular of the immediately surrounding text in\n               the following excerpt, &quot;<span lang=\"fr\">&#xC0; l&apos;occasion de l&apos;exposition &quot;Energie &#xE9;ternelle. 1500 ans d&apos;art indien&quot;, le Palais des Beaux-Arts de Bruxelles a lanc&#xE9; son premier podcast. Vous pouvez t&#xE9;l&#xE9;charger ce podcast au format M4A et MP3</span>&quot;, no indication of language change is required.\n            </p>\n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/unusual-words.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=313#unusual-words",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/unusual-words.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>A mechanism is available for identifying specific definitions of words or phrases used in an unusual or restricted way, including idioms and jargon.\n   </p>\n   \n",
                            "id": "3.1.3",
                            "name": "Unusual Words",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "Organize the list or &quot;cascade&quot; of dictionaries and other resources so that the definition\n               search will find the intended definitions instead of displaying definitions from other\n               sources in the &quot;cascade.&quot; (The &quot;cascade&quot; lists the dictionaries and other reference\n               materials in the order most likely to bring up the right definition. This controls\n               the order to follow when searching for definitions.)"
                                },
                                {
                                    "content": "WCAG 2.0 uses the word &quot;text&quot; in a specific way. Thus, when the word &quot;text&quot; is used\n               within WCAG 2.0 it is linked to the definition of &quot;text&quot; provided in a glossary within\n               the same Web page."
                                },
                                {
                                    "content": "The internal link from the word to the corresponding definition is also provided within the page."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/abbreviations.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=314#abbreviations",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/abbreviations.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>A mechanism for identifying the expanded form or meaning of abbreviations is available.\n   </p>\n   \n",
                            "id": "3.1.4",
                            "name": "Abbreviations",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "The name, &quot;World Wide Web Consortium,&quot; appears as the first heading on the organization&apos;s\n               home page. The abbreviation, &quot;W3C,&quot; is enclosed in parentheses in the same heading."
                                },
                                {
                                    "content": "A Web site includes a search form provided by an on-line acronym service. Users enter\n               an acronym and the form returns a list of possible expansions from the sources that\n               it searched."
                                },
                                {
                                    "content": "A medical Web site provides information for both doctors and patients. The site includes\n               a set of cascading dictionaries;  a very specialized medical dictionary is first,\n               followed by a second medical dictionary for the general public. The cascade also includes\n               a list of acronyms and abbreviations that are unique to the site, and finally there\n               is a standard dictionary as well. The standard dictionary at the end of the list provides\n               definitions for most words in the text. The specialized medical dictionary yields\n               definitions of unusual medical terms. Definitions for words that appear in more than\n               one dictionary are listed in the order of the cascade. The meaning of acronyms and\n               abbreviations is provided by the list of acronyms and abbreviations."
                                },
                                {
                                    "content": "The expanded form of each abbreviation is available in a programmatically determinable\n               manner. User agents that speak the text can use the expanded form to announce the\n               abbreviation. Other user agents might make the expanded form available as a tooltip\n               or as contextual help for the abbreviation."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/reading-level.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=315#reading-level",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/reading-level.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>When text requires reading ability more advanced than the lower secondary education level after removal of proper names and titles, supplemental content, or a version that does not require reading ability more advanced than the lower\n      secondary education level, is available.\n   </p>\n   \n",
                            "id": "3.1.5",
                            "name": "Reading Level",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "\n            <p>The text below (116 words total) requires a reading ability of grade 4.2 in the United\n               States according to the Flesch-Kincaid formula. In the US, grade 4.2 is at the primary\n               education level.</p>\n            <p>Science is about testing &#x2014; and about looking closely. Some scientists use microscopes\n               to take a close look. We&apos;re going to use a simple piece of paper.</p>\n            <p>Here&apos;s what you do: Print this page and cut out the square to make a &quot;window&quot; one\n               inch square. (It&apos;s easiest to fold the page in half before you cut.)</p>\n            <p>Choose something interesting: a tree trunk, a leaf, flower, the soil surface, or a\n               slice of soil from a shovel.</p>\n            <p>Put your window over the thing and look at it closely. Take your time &#x2014; this is not a race.</p>\n            <p>To help you see more details, draw a picture of what&apos;s inside your square.</p>\n            <p>Now let&apos;s think about what you&apos;ve found. </p>\n            <p>(Source: Howard Hughes Medical Institute &quot;CoolScience for Kids&quot; Project)</p>\n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/pronunciation.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=316#pronunciation",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/pronunciation.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>A mechanism is available for identifying specific pronunciation of words where meaning of the\n      words, in context, is ambiguous without knowing the pronunciation.\n   </p>\n   \n",
                            "id": "3.1.6",
                            "name": "Pronunciation",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "Web content in Japanese provides kana (Japanese phonetic syllabary characters) written\n               next to Han characters (Kanji)  show the pronunciation of a person&apos;s name. The kana\n               is provided to users in parentheses right after the word. Giving the reading of the\n               words written in Han characters (Kanji) allows both sighted users and screen readers\n               to read/pronounce the words correctly. Note that screen readers will speak the word\n               twice: the Han characters (Kanji) that can be pronounced in a wrong way are read first\n               and then kana is spoken in order to provide the correct reading."
                                },
                                {
                                    "content": "Web content using XHTML 1.1 provides kana (phonetic syllabary characters) written\n               above the characters to show the reading (pronunciation) of the words by using the\n               ruby element."
                                },
                                {
                                    "content": "A document includes some words whose meaning cannot be determined without knowing\n               the correct pronunciation. Each word is linked to a sound file that gives the correct\n               pronunciation. Users can select these links to find out how to pronounce the words."
                                },
                                {
                                    "content": "A Web page includes a glossary section. Some items in the glossary include pronunciation\n               information as well as definitions. Words in the content whose meaning cannot be determined\n               without knowing their pronunciation are linked to the appropriate entries in the glossary."
                                },
                                {
                                    "content": "A Japanese university Web site includes several short phrases quoted from scholarly\n               texts in Chinese and Korean. The quotations are written using the same script as the\n               Japanese text. Pronunciation information is provided to show the correct reading of\n               the Chinese and Korean characters."
                                }
                            ]
                        }
                    ],
                    "id": "3.1",
                    "name": "Readable"
                },
                {
                    "paraText": "Make Web pages appear and operate in predictable ways.",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/on-focus.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=321#on-focus",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/on-focus.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>When any user interface component receives focus, it does not initiate a change of context.\n   </p>\n   \n",
                            "id": "3.2.1",
                            "name": "On Focus",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A dropdown menu on a page allows users to choose between jump destinations. If the\n               person uses the keyboard to move down to a choice and activates it (with a spacebar\n               or enter key) it will jump to a new page.  However, if the person moves down to a\n               choice and either hits the escape or the tab key to move out of the pulldown menu\n               &#x2013; it does not jump to a new screen as the focus shifts out of the dropdown menu."
                                },
                                {
                                    "content": "When a field receives focus, a help dialog window describing the field and providing\n               options opens. As a keyboard user tabs through the Web page, the dialog opens, moving\n               the keyboard focus away from the control every time the user attempts to tab past\n               the field."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/on-input.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=322#on-input",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/on-input.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Changing the setting of any user interface component does not automatically cause a change of context unless the user has been advised of the behavior before using the component.\n   </p>\n   \n",
                            "id": "3.2.2",
                            "name": "On Input",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "\n            A form is provided for creating calendar entries in a Web based calendaring and scheduling\n            application. Along with the standard fields for subject, time and location, there\n            is a set of radio buttons to select the type of calendar entry to create.  The calendar\n            entry type can be meeting, appointment or reminder.  If the user selects the radio\n            for meeting, additional fields are displayed on the page for entering the meeting\n            participants. Different fields appear if the reminder button is chosen. Because only\n            parts of the entry change and the overall structure remains the same the basic context\n            remains for the user.  \n            \n         "
                                },
                                {
                                    "content": "\n            A form contains fields representing US phone numbers. All of the numbers have a three\n            digit area code followed by a three digit prefix and finally a four digit number,\n            and each part of the phone number is entered into a separate field. When the user\n            completes the entry of one field the focus automatically moves to the next field of\n            the phone number. This behavior of phone fields is described for the user at the beginning\n            of the form.\n            \n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/consistent-navigation.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=323#consistent-navigation",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/consistent-navigation.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Navigational mechanisms that are repeated on multiple Web pages within a set of Web pages occur in the same relative order each time they are repeated, unless a change is initiated by the user.\n   </p>\n   \n",
                            "id": "3.2.3",
                            "name": "Consistent Navigation",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "A search field is the last item on every Web page in a site. Users can quickly locate the search function."
                                },
                                {
                                    "content": "A navigation menu includes a list of seven items with links to the main sections of a site.\n               When a user selects one of these items, a list of sub-navigation items is inserted\n               into the top-level navigation menu."
                                },
                                {
                                    "content": "A &quot;skip navigation&quot; (or &quot;skip to main content&quot;) link is included as the first link\n               on every page in a Web site. The link allows users to quickly bypass heading information\n               and navigational content and begin interacting with the main content of a page."
                                },
                                {
                                    "content": "Navigational content is consistently located at the end of each page in a set of Web\n               pages. A &quot;skip to navigation&quot; link is consistently located at the beginning of each\n               page so that keyboard users can easily locate it when needed."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/consistent-identification.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=324#consistent-identification",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/consistent-identification.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Components that have the same functionality within a set of Web pages are identified consistently.\n   </p>\n   \n",
                            "id": "3.2.4",
                            "name": "Consistent Identification",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "A document icon is used to indicate document download throughout a site. The text\n               alternative for the icon always begins with the word &#x201C;Download,&quot; followed by a shortened\n               form of the document title. Using different text alternatives to identify document\n               names for different documents is a consistent use of text alternatives."
                                },
                                {
                                    "content": "A check mark icon functions as &quot;approved&quot;, on one page but as &quot;included&quot; on another.\n               Since they serve different functions, they have different text alternatives."
                                },
                                {
                                    "content": " A Web site publishes articles on-line. Each article spans multiple Web pages and\n               each page contains a link to the first page, the next page and the previous page of\n               the article. If the references to the next page read &quot;page 2&quot;, &quot;page 3&quot;, &quot;page 4&quot;\n               etcetera, the labels are not the same but they are consistent. Therefore, these references\n               are not failures of this Success Criterion."
                                },
                                {
                                    "content": "An e-commerce application uses a printer icon that allows the user to print receipts\n               and invoices. In one part of the application, the printer icon is labeled &quot;Print receipt&quot;\n               and is used to print receipts, while in another part it is labeled &quot;Print invoice&quot;\n               and is used to print invoices. The labeling is consistent (&quot;Print x&quot;), but the labels\n               are different to reflect the different functions of the icons. Therefore, this example\n               does not fail the Success Criterion."
                                },
                                {
                                    "content": "A common &quot;save&quot; icon is used through out the site where page save function is provided\n               on multiple Web pages."
                                },
                                {
                                    "content": "An icon with alt text and a link are next to each other and go to the same location.\n               The best practice would be to group them into one link as per \n               <a href=\"https://www.w3.org/WAI/WCAG22/Techniques/html/H2\">H2: Combining adjacent image and text links for the same resource</a>. However if they are visually positioned one above the other but separated in the\n               source, this may not be possible. To meet the Success Criterion, the link text for\n               these two links need only be consistent, not identical. But best practice is to have\n               identical text so that when users encounter the second one, it is clear that it goes\n               to the same place as the first."
                                },
                                {
                                    "content": "A submit &quot;search&quot; button on one Web page and a &quot;find&quot; button on another Web page both\n               have a field to enter a term and list topics in the Web site related to the term submitted.\n               In this case, the buttons have the same functionality but are not labeled consistently."
                                },
                                {
                                    "content": "Two buttons with the same functionality visually have the same text, but have been given\n                  different <code>aria-label=&quot;...&quot;</code> accessible names. For users of assistive technologies,\n                  these two buttons will be announced differently and inconsistently."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/change-on-request.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=325#change-on-request",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/change-on-request.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Changes of context are initiated only by user request or a mechanism is available to turn off such changes.\n   </p>\n   \n",
                            "id": "3.2.5",
                            "name": "Change on Request",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": " Instead of automatically updating the content, the author provides an &quot;Update now&quot;\n               button that requests a refresh of the content."
                                },
                                {
                                    "content": "Users are automatically redirected from an old page to a new page in such a way that\n               they never realize the redirect has occurred."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/consistent-help.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=326#consistent-help",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/consistent-help.html#examples"
                            },
                            "contentMarkup": "\n   \n    \n    \n    \n\t<p class=\"change\">[New]</p>\n    \n  <p>If a Web page contains any of the following help mechanisms, and those mechanisms are repeated on multiple Web pages within a set of Web pages, they occur in the same order relative to other page content, unless a change is initiated by the user:</p>\n\n    <ul>\n        <li>Human contact details;</li>\n        <li>Human contact mechanism;</li>\n        <li>Self-help option;</li>\n        <li>A fully automated contact mechanism.</li>\n    </ul>\n\n  \n  \n\n ",
                            "id": "3.2.6",
                            "name": "Consistent Help",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "On-line job application: Some of the application questions may be hard for new job seekers to understand even after reading the contextual help. For example, the form may request their identification number, but they may have several and not know which one to enter. Consistently located contact information will enable them to use phone or email so they can get an answer to their question."
                                },
                                {
                                    "content": "Medical appointment scheduling form: When the service a patient is trying to book is not easily findable within the interface, they may need human help. A consistently located messaging option (chat client) enables them to quickly interact with a staff person that can help, without requiring them to manage a second interface."
                                },
                                {
                                    "content": "Finding a specific policy or procedure: An employee who needs to complete a work task may have difficulty locating the specific policy or procedure document on their employer&apos;s Web site. A consistently located &quot;How Do I&quot; page may include the information that enables them to independently complete this task."
                                }
                            ]
                        }
                    ],
                    "id": "3.2",
                    "name": "Predictable"
                },
                {
                    "paraText": "Help users avoid and correct mistakes.",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/error-identification.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=331#error-identification",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/error-identification.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>If an input error is automatically detected, the item that is in error is identified and the error\n      is described to the user in text.\n   </p>\n   \n",
                            "id": "3.3.1",
                            "name": "Error Identification",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "\n            <p>An airline Web site offers a special promotion on discounted flights. The user is\n               asked to complete a simple form that asks for personal information such as name, address,\n               phone number, seating preference and e-mail address. If any of the fields of the form\n               are either not completed or completed incorrectly, an alert is displayed notifying\n               the user which field or fields were missing or incorrect.</p>\n\n            \n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/labels-or-instructions.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=332#labels-or-instructions",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/labels-or-instructions.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Labels or instructions are provided when content requires user input.\n   </p>\n   \n",
                            "id": "3.3.2",
                            "name": "Labels or Instructions",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A field which requires the user to enter the two character abbreviation for a US state\n            has a link next to it which will popup an alphabetized list of state names and the\n            correct abbreviation.\n         "
                                },
                                {
                                    "content": "A field for entering a date contains initial text which indicates the correct format\n            for the date.\n         "
                                },
                                {
                                    "content": "To enter their name, users are provided with two separate text fields. Rather than\n            having a single label &quot;Name&quot; (which would appear to leave the second text field unlabelled),\n            each field is given an explicit label - &quot;Given Name&quot; and &quot;Family Name&quot;.\n         "
                                },
                                {
                                    "content": "A U.S. phone number separates the area code, exchange, and number into three fields.\n            Parentheses surround the area code field, and a dash separates the exchange and number\n            fields. While the punctuation provides visual clues to those familiar with the U.S.\n            telephone number format, the punctuation is not sufficient to label the fields. The\n            single &quot;Phone number&quot; label also cannot label all three fields. To address this, the\n            three fields are grouped in a fieldset with the legend &quot;Phone number&quot;. Visual labels for\n            the fields (beyond the punctuation) cannot be provided\n            in the design, so invisible labels are provided with the &quot;title&quot; attribute to each\n            of the three fields. The value of this attribute for the three fields are, respectively,\n            &quot;Area Code&quot;, &quot;Exchange&quot;, and &quot;Number&quot;. \n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/error-suggestion.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=333#error-suggestion",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/error-suggestion.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>If an input error is automatically detected and suggestions for correction are known, then the suggestions\n      are provided to the user, unless it would jeopardize the security or purpose of the\n      content.\n   </p>\n   \n",
                            "id": "3.3.3",
                            "name": "Error Suggestion",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "\n            <p>An input field requires that a month name be entered. If the user enters &quot;12,&quot; suggestions\n               for correction may include:</p>\n            \n            <ul>\n               <li>A list of the acceptable values, e.g., &quot;Choose one of: January, February, March, April,\n                  May, June, July, August, September, October, November, December.&quot;\n               </li>\n               <li>The conversion of the input data interpreted as a different month format, e.g., &quot;Do\n                  you mean &apos;December&apos;?&quot;\n               </li>\n            </ul>\n         "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/error-prevention-legal-financial-data.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=334#error-prevention-legal-financial-data",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/error-prevention-legal-financial-data.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>For Web pages that cause legal commitments or financial transactions for the user to occur, that modify or delete user-controllable data in data storage systems, or that submit user test responses, at least one of\n      the following is true:\n   </p>\n\n   <dl>\n     <dt>Reversible</dt><dd>Submissions are reversible.</dd>\n     <dt>Checked</dt><dd>Data entered by the user is checked for input errors and the user is provided an opportunity to correct them.</dd>\n     <dt>Confirmed</dt><dd>A mechanism is available for reviewing, confirming, and correcting information before finalizing the submission.</dd>\n  </dl>\n  \n",
                            "id": "3.3.4",
                            "name": "Error Prevention (Legal, Financial, Data)",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "A Web retailer offers on-line shopping for customers. When an order is submitted,\n               the order information&#x2014;including items ordered, quantity of each ordered item, shipping\n               address, and payment method&#x2014;are displayed so that the user can inspect the order for\n               correctness. The user can either confirm the order or make changes."
                                },
                                {
                                    "content": "A financial services Web site lets users buy and sell stock online. When a user submits\n               an order to buy or sell stock, the system checks to see whether or not the market\n               is open. If it is after hours, the user is alerted that the transaction will be an\n               after-hours transaction, is told about the risks of trading outside of regular market\n               hours, and given the opportunity to cancel or confirm the order."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/help.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=335#help",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/help.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>Context-sensitive help is available.\n   </p>\n   \n",
                            "id": "3.3.5",
                            "name": "Help",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "Some of the questions may be hard for new job seekers to understand. A help link\n               next to each question provides instructions and explanations for each question."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/error-prevention-all.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=336#error-prevention-all",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/error-prevention-all.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>For Web pages that require the user to submit information, at least one of the following is true:\n   </p>\n   \n   <dl>\n     <dt>Reversible</dt><dd>Submissions are reversible.</dd>\n     <dt>Checked</dt><dd>Data entered by the user is checked for input errors and the user is provided an opportunity to correct them.</dd>\n     <dt>Confirmed</dt><dd>A mechanism is available for reviewing, confirming, and correcting information before finalizing the submission.</dd>\n  </dl>\n\n",
                            "id": "3.3.6",
                            "name": "Error Prevention (All)",
                            "level": "AAA",
                            "examples": []
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/redundant-entry.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=337#redundant-entry",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/redundant-entry.html#examples"
                            },
                            "contentMarkup": "\n   \n    \n    \n    \n\t<p class=\"change\">[New]</p>\n    \n    <p>Information previously entered by or provided to the user that is required to be entered again in the same process is either:</p>\n\n    <ul>\n        <li>auto-populated, or</li>\n        <li>available for the user to select.</li>\n    </ul>\n    <p>Except when:</p> \n    <ul>\n        <li>re-entering the information is essential,</li>\n        <li>the information is required to ensure the security of the content, or</li>\n        <li>previously entered information is no longer valid.</li>\n    </ul>\n\n ",
                            "id": "3.3.7",
                            "name": "Redundant Entry",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A form requests the user&#x2019;s corporate identification number (ID) in the first step of a process to purchase a new computer. In the 3rd step the user is asked to confirm that the computer will belong to the user (rather than a colleague), and re-shows the ID. It allows the user to change the ID, but defaults to the previously entered one."
                                },
                                {
                                    "content": "A form on an e-commerce website allows the user to confirm that the billing address and delivery address are the same address."
                                },
                                {
                                    "content": "A search results page pre-fills the search input with the previously entered search term in the same process."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/accessible-authentication-minimum.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=338#accessible-authentication-minimum",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/accessible-authentication-minimum.html#examples"
                            },
                            "contentMarkup": "\n   \n    \n    \n    \n\t<p class=\"change\">[New]</p>\n    \n    <p>A cognitive function test (such as remembering a password or solving a puzzle) is not required for any step in an authentication process unless that step provides at least one of the following:</p> \n    <dl>\n        <dt>Alternative</dt>\n        <dd>Another authentication method that does not rely on a cognitive function test.</dd>\n        <dt>Mechanism</dt>\n      <dd>A mechanism is available to assist the user in completing the cognitive function test.</dd>\n        <dt>Object Recognition</dt>\n        <dd>The cognitive function test is to recognize objects.</dd>\n        <dt>Personal Content</dt>\n      <dd>The cognitive function test is to identify non-text content the user provided to the Web site.</dd>\n    </dl>\n\n    \n    \n    \n ",
                            "id": "3.3.8",
                            "name": "Accessible Authentication (Minimum)",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "\n      <h2>Examples</h2>\n      <p>The examples of this Success Criterion are the same as the <a href=\"accessible-authentication-enhanced.html#examples\">Accessible Authentication (Enhanced)</a> examples.</p>\n\n      <ul>\n         <li>A web site uses a properly marked up username (or email) and password fields as the login authentication (meeting <a href=\"identify-input-purpose\">Success Criterion 1.3.5 Input Purpose</a> and <a href=\"name-role-value\">Success Criterion 4.1.2: Name, Role, Value</a>). The user&apos;s browser or integrated third-party password manager extension can identify the purpose of the inputs and automatically fill in the username and password.</li>\n         <li>A web site does not block paste functionality. The user is able to use a third-party password manager to store credentials, copy them, and paste them directly into a login form.</li>\n         <li>A web site uses WebAuthn so the user can authenticate with their device instead of username/password. The user&apos;s device could use any available modality. Common methods on laptops and phones are facial-scan, fingerprint, and PIN (Personal Identification Number). The web site is not enforcing any particular use; it is assumed a user will set up a method that suits them.</li>\n         <li>A web site offers the ability to login with a third-party provider using the OAuth method.</li>\n         <li>A web site that requires two-factor authentication allows for multiple options for the 2nd factor, including a USB-based method where the user simply presses a button to enter a time-based token.</li>\n         <li>A web site that requires two-factor authentication displays a QR code which can be scanned by an app on a user&apos;s device to confirm identity.</li>\n         <li>A web site that requires two-factor authentication sends a notification to a user&apos;s device. The user must use their device&apos;s authentication mechanism (for example, user-defined PIN, fingerprint, facial recognition) to confirm identity.</li>\n      </ul>\n      \n   "
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/accessible-authentication-enhanced.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=339#accessible-authentication-enhanced",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/accessible-authentication-enhanced.html#examples"
                            },
                            "contentMarkup": "\n   \n    \n    \n    \n\t<p class=\"change\">[New]</p>\n    \n    <p>A cognitive function test (such as remembering a password or solving a puzzle) is not required for any step in an authentication process unless that step provides at least one of the following:</p> \n    <dl>\n        <dt>Alternative</dt>\n        <dd>Another authentication method that does not rely on a cognitive function test.</dd>\n        <dt>Mechanism</dt>\n        <dd>A mechanism is available to assist the user in completing the cognitive function test.</dd>\n    </dl>\n    \n ",
                            "id": "3.3.9",
                            "name": "Accessible Authentication (Enhanced)",
                            "level": "AAA",
                            "examples": [
                                {
                                    "content": "\n      <h2>Examples</h2>\n\n      <p>The examples of this Success Criterion are very similar to the <a href=\"accessible-authentication-minimum.html#examples\">Accessible Authentication (Minimum)</a> examples.</p>\n\n      <ul>\n        <li>A web site uses a properly marked up username (or email) and password fields as the login authentication (meeting <a href=\"identify-input-purpose\">Success Criterion 1.3.5 Input Purpose</a> and <a href=\"name-role-value\">Success Criterion 4.1.2: Name, Role, Value</a>). The user&apos;s browser or integrated third-party password manager extension can identify the purpose of the inputs and automatically fill in the username and password.</li>\n        <li>A web site does not block paste functionality. The user is able to use a third-party password manager to store credentials, copy them, and paste them directly into a login form.</li>\n        <li>A web site uses WebAuthn so the user can authenticate with their device instead of username/password. The user&apos;s device could use any available modality. Common methods on laptops and phones are facial-scan, fingerprint, and PIN (Personal Identification Number). The web site is not enforcing any particular use; it is assumed a user will set up a method that suits them.</li>\n        <li>A web site offers the ability to login with a third-party provider using the OAuth method.</li>\n        <li>A web site that requires two-factor authentication allows for multiple options for the 2nd factor, including a USB-based method where the user simply presses a button to enter a time-based token.</li>\n        <li>A web site that requires two-factor authentication displays a QR code which can be scanned by an app on a user&apos;s device to confirm identity.</li>\n        <li>A web site that requires two-factor authentication sends a notification to a user&apos;s device. The user must use their device&apos;s authentication mechanism (for example, user-defined PIN, fingerprint, facial recognition) to confirm identity.</li>\n      </ul>\n\n   "
                                }
                            ]
                        }
                    ],
                    "id": "3.3",
                    "name": "Input Assistance"
                }
            ],
            "id": "3.",
            "name": "Understandable "
        },
        {
            "paraText": "Content must be robust enough that it can be interpreted by a wide variety of user\n            agents, including assistive technologies.\n         ",
            "guidelines": [
                {
                    "paraText": "Maximize compatibility with current and future user agents, including assistive technologies.",
                    "successCriteria": [
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/parsing.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=411#parsing",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/parsing.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n\n   \n   \n",
                            "id": "4.1.1",
                            "name": "Parsing (Obsolete and removed)",
                            "level": "",
                            "examples": []
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/name-role-value.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=412#name-role-value",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/name-role-value.html#examples"
                            },
                            "contentMarkup": "\n   \n   \n   \n   \n   \n   <p>For all user interface components (including but not limited to: form elements, links and components generated by scripts),\n      the name and role can be programmatically determined; states, properties, and values that can be set by the user can be programmatically set; and notification of changes to these items is available to user agents, including assistive technologies.\n   </p>\n   \n   \n   \n",
                            "id": "4.1.2",
                            "name": "Name, Role, Value",
                            "level": "A",
                            "examples": [
                                {
                                    "content": "A Java applet uses the accessibility API defined by the language."
                                }
                            ]
                        },
                        {
                            "links": {
                                "understand": "https://www.w3.org/WAI/WCAG22/Understanding/status-messages.html",
                                "meet": "https://www.w3.org/WAI/WCAG22/quickref/?showtechniques=413#status-messages",
                                "examples": "https://www.w3.org/WAI/WCAG22/Understanding/status-messages.html#examples"
                            },
                            "contentMarkup": "\n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   \n   \t\t\t\t\t\n   <p>In content implemented using markup languages, status messages can be programmatically determined through role or properties such that they can be presented to the user by assistive technologies without receiving focus.</p>\n   \t\t\t\t\n",
                            "id": "4.1.3",
                            "name": "Status Messages",
                            "level": "AA",
                            "examples": [
                                {
                                    "content": "\n\t\t\t\t<h3>Status Message Examples</h3>\n\n\t\t\t\t<ul>\n\t\t\t\t\t<li>After a user presses a Search button, the page content is updated to include the results of the search, which are displayed in a section below the Search button. The change to content also includes the message &quot;5 results returned&quot; near the top of this new content. This text is given an appropriate role for a status message. A screen reader announces, &quot;Five results returned&quot;.</li>\n\t\t\t\t\t<li>After a user presses an Add to Shopping Cart button, a section of content near the Shopping Cart icon adds the text &quot;5 items&quot;. A screen reader announces &quot;Five items&quot; or &quot;Shopping cart, five items&quot;.</li>\n\t\t\t\t\t<li>After a user enters incorrect text in an input called Postal Code, a message appears above the input reading &quot;Invalid entry&quot;.  The screen reader announces, &quot;Invalid entry&quot; or &quot;Postal code, invalid entry&quot;.</li>\n\t\t\t\t\t<li>After a user activates a process, an icon symbolizing &apos;busy&apos;  appears on the screen. The screen reader announces &quot;application busy&quot;. </li>\n\t\t\t\t\t<li>An application displays a progressbar to indicate the status of an upgrade. The element is assigned a suitable role. The screen reader provides intermittent announcements of the progress. </li>\n\t\t\t\t\t<li>After a user submits a form, text is added to the existing form which reads, &quot;Your form was successfully submitted.&quot; The screen reader announces the same message.</li> \n\t\t\t\t\t<li>After a user unsuccessfully fills in a form because some of the data is in the incorrect format, text is added to the existing form which reads &quot;5 errors on page&quot;. The screen reader announces the same message.</li>\n\t\t\t\t\t<li>After a user puts a photo in an album in an online photo app, a <a href=\"https://material.io/design/components/snackbars.html#\">snackbar </a> displays the message &quot;Saved in &apos;Wedding&apos; album&quot;, which is also read by a screen reader.</li>\n\t\t\t\t</ul>\n\t\t\t"
                                },
                                {
                                    "content": "\n\t\t\t\t<h3>Examples of Status Messages that Do Not Add New Text to the Screen</h3>\n\t\t\t<p>This Success Criterion was intentionally worded to apply primarily when visible text is added to (or becomes visible on) the page. The reason for this is that where new text is displayed, it is intended to be visible to all users. By providing a programmatic means of ensuring the text is also surfaced through assistive technologies, the Success Criterion provides the same information to users who cannot or may not see it. However, not all changes to content involve the addition of text to the screen. The following are all considerations relevant to this Success Criterion:</p>\n\t\t\t\t<ul>\n\t\t\t\t\t<li>Non-displayed text specific to AT users;</li>\n\n<li>Modification of status text;</li>\n<li>Removal of status text; and</li>\n<li>Non-textual status content, such as images.</li>\n\t\t\t\t</ul>\n\t\t\t\t<section id=\"non-displayed-text-specific-to-at-users\">\n\t\t<h4>Non-displayed text specific to AT users</h4>\n\t\t\n\t\t<p>There may be cases where the addition of visible text does not by itself convey sufficient information to the user of assistive technology. For example, the proximity of new content to other pieces of information on the screen may provide a visual context that is lacking in the text alone.</p>\n\t\t<p>In such cases, authors may wish to designate additional content for inclusion in the status message, including non-displayed text which can be provided to the assistive technologies, for added context. Important considerations regarding the appropriate use of such techniques are further discussed in the Sufficient Techniques.</p>\n\t\t\t\t</section>\n\t\t\t\t<section id=\"modification-of-status-text\">\n\t\t<h4>Modification of status text</h4>\n\t\t<p>If a status message persists on the page, modifications to this text are usually equivalent to a new status message. An example would be a shopping cart which updates text from reading &quot;0 items&quot; to &quot;3 items&quot;. Typical methods of writing such changes in the page content result in the entire modified text string being considered a new change, and thus read by assistive technologies. However, where only the number in this string was coded as an updated chunk of content, the resulting experience for screen reader users could be to only hear &quot;three&quot;, which may not be sufficient information to provide context for the user. In such situations, marking the entire &quot;3 items&quot; string as the status text would normally be a better solution. See Sufficient Techniques for more discussion, including the use of <code>aria-atomic</code>. In this case it would also be a courtesy to add offscreen text such as &quot;in shopping cart&quot; to the message.</p>\n\t\t\t\t</section>\n\t\t\t\t<section id=\"removal-of-status-text\">\n\t\t<h4>Removal of status text</h4>\n\t\t<p>In situations where status text is entirely removed, its absence may itself convey information about the status. The most obvious example of this is where a message is displayed that the system is &quot;busy&quot; or &quot;waiting&quot;. For a sighted user, when this text disappears, it is normally an indication that the state is now available. However non-sighted users would be unaware of this change, unless the end of the waiting state results in a change of context for the user. Where updating the visible message (e.g., to &quot;system available&quot;) is not feasible, the use of a non-visible status message, such as &quot;system available&quot;, ensures equivalent status information is provided. See Sufficient Techniques for more discussion.</p>\n\t\t\t\t</section>\n\t\t\t\t<section id=\"non-textual-status-content\">\n\t\t<h4>Non-textual status content</h4>\n\t\t<p>Changes in content are not restricted to text changes. Where an icon or sound indicates a status message, this information will be surfaced by the screen reader through a combination of two things: 1) existing WCAG requirements governing text alternatives (under SC 1.1.1 Non-Text Content), and 2) the requirement of this current Success Criterion to supply an appropriate role.</p>\n\t\t\t\t</section>\n\t\t\t"
                                },
                                {
                                    "content": "\n\t\t<h4>Non-displayed text specific to AT users</h4>\n\t\t\n\t\t<p>There may be cases where the addition of visible text does not by itself convey sufficient information to the user of assistive technology. For example, the proximity of new content to other pieces of information on the screen may provide a visual context that is lacking in the text alone.</p>\n\t\t<p>In such cases, authors may wish to designate additional content for inclusion in the status message, including non-displayed text which can be provided to the assistive technologies, for added context. Important considerations regarding the appropriate use of such techniques are further discussed in the Sufficient Techniques.</p>\n\t\t\t\t"
                                },
                                {
                                    "content": "\n\t\t<h4>Modification of status text</h4>\n\t\t<p>If a status message persists on the page, modifications to this text are usually equivalent to a new status message. An example would be a shopping cart which updates text from reading &quot;0 items&quot; to &quot;3 items&quot;. Typical methods of writing such changes in the page content result in the entire modified text string being considered a new change, and thus read by assistive technologies. However, where only the number in this string was coded as an updated chunk of content, the resulting experience for screen reader users could be to only hear &quot;three&quot;, which may not be sufficient information to provide context for the user. In such situations, marking the entire &quot;3 items&quot; string as the status text would normally be a better solution. See Sufficient Techniques for more discussion, including the use of <code>aria-atomic</code>. In this case it would also be a courtesy to add offscreen text such as &quot;in shopping cart&quot; to the message.</p>\n\t\t\t\t"
                                },
                                {
                                    "content": "\n\t\t<h4>Removal of status text</h4>\n\t\t<p>In situations where status text is entirely removed, its absence may itself convey information about the status. The most obvious example of this is where a message is displayed that the system is &quot;busy&quot; or &quot;waiting&quot;. For a sighted user, when this text disappears, it is normally an indication that the state is now available. However non-sighted users would be unaware of this change, unless the end of the waiting state results in a change of context for the user. Where updating the visible message (e.g., to &quot;system available&quot;) is not feasible, the use of a non-visible status message, such as &quot;system available&quot;, ensures equivalent status information is provided. See Sufficient Techniques for more discussion.</p>\n\t\t\t\t"
                                },
                                {
                                    "content": "\n\t\t<h4>Non-textual status content</h4>\n\t\t<p>Changes in content are not restricted to text changes. Where an icon or sound indicates a status message, this information will be surfaced by the screen reader through a combination of two things: 1) existing WCAG requirements governing text alternatives (under SC 1.1.1 Non-Text Content), and 2) the requirement of this current Success Criterion to supply an appropriate role.</p>\n\t\t\t\t"
                                },
                                {
                                    "content": "\n\t\t\t\t<h3>Examples of Changes That Are Not Status Messages</h3>\n\n\t\t\t<p>The following examples identify situations where no additional author action is necessary. All cases are excepted from this Success Criterion since they do not meet the definition of &quot;status messages.&quot;</p>\n\t\t\t<ul>\n\t\t\t<li><p>An author displays an error message in a dialog.</p>\n\t\t\t\t<p>Since the dialog takes focus, it is defined as a change of context and does not meet the definition of a status message. As a result of taking focus, the new change of context is already announced by the screen reader, and thus does not need to be included in the scope of this Success Criterion. </p>\n\t\t\t</li>\n\t\t\t<li>\n\t\t\t\t<p>Content is exposed or hidden when a user interacts with a user interface component, for example expanding components such as a menu, select, accordion or tree, or selecting a different tab item in a tablist.</p>\n\t\t\t\t<p>None of the resulting changes to content meet the definition of status messages. Further, all components that meet the definition of a user interface component already have requirements specified under <a href=\"name-role-value\" class=\"sc\">4.1.2 Name, Role, Value</a>, including the need to make notifications of changes to values and states available to user agents, including assistive technologies. As a result, changes in state, such as &quot;expanded&quot; or &quot;collapsed,&quot; would be announced by the screen reader, and thus the user would be alerted to the &apos;addition&apos; or &apos;removal&apos; of content. As such, such content does not need to be addressed by this Success Criterion.</p>\n\n\t\t\t</li>\n\t\t\t<li>\n\t\t\t\t<p>After a user completes a survey question which indicates they are unhappy, a series of new questions are added to the page about customer satisfaction.</p>\n\t\t\t\t<p>The new inputs do not meet the definition of status message. They do not &quot;provide information to the user on the success or results of an action, on the waiting state of an application, on the progress of a process or on the existence of errors,&quot; and so are not required to meet this Success Criterion.</p>\n\t\t\t\t\n\t\t\t\t</li>\n\n\t\t\t</ul>\n\t\t\t"
                                },
                                {
                                    "content": "\n\t\t<h3>Other uses of live regions or alerts</h3>\n\n<p>Live regions and alerts can be usefully applied in many situations where a change of content takes place which does not constitute a status message, as defined in this Success Criterion. However, there is a risk of making an application too &quot;chatty&quot; for a screen reader user. User testing should be carried out to ensure the appropriate level of feedback is achieved. The Advisory Techniques provide examples of how alerts or live regions can enhance the user experience.</p>\n\n\n\t\t"
                                }
                            ]
                        }
                    ],
                    "id": "4.1",
                    "name": "Compatible"
                }
            ],
            "id": "4.",
            "name": "Robust "
        }
    ]
}